const QUESTION_GROUPS = {
  "表記（前半レベル [ひらがな・カタカナ] ）": [
    { q: "いす", options: ["isu", "isa", "asu", "ashi"], answer: "isu" },
    { q: "かみ", options: ["kami", "kimi", "kama", "kuma"], answer: "kami" },
    {
      q: "した",
      options: ["shita", "satsu", "sata", "shito"],
      answer: "shita",
    },
    { q: "すし", options: ["sushi", "sashi", "suso", "sasu"], answer: "sushi" },
    { q: "いま", options: ["ima", "imi", "rima", "rin"], answer: "ima" },
    {
      q: "おさけ",
      options: ["osake", "oshike", "osaki", "osoku"],
      answer: "osake",
    },
    {
      q: "さかな",
      options: ["sakana", "kikama", "nakama", "sakuma"],
      answer: "sakana",
    },
    {
      q: "にほん",
      options: ["nihon", "nihan", "kehon", "nohun"],
      answer: "nihon",
    },
    {
      q: "つくえ",
      options: ["tsukue", "tsukei", "sukue", "sukai"],
      answer: "tsukue",
    },
    {
      q: "やさい",
      options: ["yasai", "yasui", "rasai", "rasei"],
      answer: "yasai",
    },
    {
      q: "きゃく",
      options: ["kyaku", "kiyaku", "kiaku", "kyaiku"],
      answer: "kyaku",
    },
    { q: "きょう", options: ["kyou", "kiou", "kyoi", "kiyou"], answer: "kyou" },
    { q: "いしゃ", options: ["isha", "ishu", "ishi", "ishu"], answer: "isha" },
    {
      q: "しゅくだい",
      options: ["shukudai", "shakudai", "shukudei", "syuudai"],
      answer: "shukudai",
    },
    {
      q: "ちゅうい",
      options: ["chuui", "chui", "chai", "chooi"],
      answer: "chuui",
    },
    { q: "ひょう", options: ["hyou", "hieu", "hiou", "hyuu"], answer: "hyou" },
    {
      q: "じゅぎょう",
      options: ["jugyou", "jigyou", "zigyou", "zigiou"],
      answer: "jugyou",
    },
    {
      q: "ちょうじょう",
      options: ["choujou", "chojou", "chiojou", "choujo"],
      answer: "choujou",
    },
    {
      q: "しゅうちゅう",
      options: ["shuuchuu", "shuchou", "shiuchuu", "shuuchu"],
      answer: "shuuchuu",
    },
    {
      q: "びょういん",
      options: ["byouin", "byoin", "biooin", "biouin"],
      answer: "byouin",
    },
    {
      q: "kyuuri",
      options: ["きゅうり", "きょうり", "きゃうり", "きゅりい"],
      answer: "きゅうり",
    },
    {
      q: "shashin",
      options: ["しゃしん", "しゅしん", "しあしん", "しょしん"],
      answer: "しゃしん",
    },
    {
      q: "ocha",
      options: ["おちゃ", "おちあ", "おきゃ", "おしゃ"],
      answer: "おちゃ",
    },
    {
      q: "choucyo",
      options: ["ちょうちょ", "ちょちょう", "ちょちょ", "ちようちょ"],
      answer: "ちょうちょ",
    },
    {
      q: "ryouri",
      options: ["りょうり", "りょり", "りようり", "りょりい"],
      answer: "りょうり",
    },
    {
      q: "kyuuryou",
      options: ["きゅうりょう", "きゅりゅう", "きょうりょう", "きゅうりゃう"],
      answer: "きゅうりょう",
    },
    {
      q: "shuushoku",
      options: ["しゅうしょく", "しょうしょく", "しゅうしゅく", "しゃうしょく"],
      answer: "しゅうしょく",
    },
    {
      q: "sanbyaku",
      options: ["さんびゃく", "さんびょく", "さんびょく", "さんびあく"],
      answer: "さんびゃく",
    },
    {
      q: "gyuunyuu",
      options: ["ぎゅうにゅう", "ぎゅにゅう", "ぎょうにょう", "ぎゅうにょう"],
      answer: "ぎゅうにゅう",
    },
    {
      q: "shachou",
      options: ["しゃちょう", "しゅちょう", "しゃちゅう", "しゃちゃう"],
      answer: "しゃちょう",
    },
    {
      q: "きって",
      options: ["kitte", "kiite", "kite", "kittee"],
      answer: "kitte",
    },
    {
      q: "がっこう",
      options: ["gakkou", "gakou", "gaakou", "gyakkou"],
      answer: "gakkou",
    },
    {
      q: "なっとう",
      options: ["nattou", "natsou", "natou", "naatou"],
      answer: "nattou",
    },
    {
      q: "にっき",
      options: ["nikki", "nekki", "nikii", "nekii"],
      answer: "nikki",
    },
    {
      q: "はっぱ",
      options: ["happa", "hampa", "hapaa", "haapa"],
      answer: "happa",
    },
    {
      q: "しっぱい",
      options: ["shippai", "shimpai", "shipai", "shippei"],
      answer: "shippai",
    },
    {
      q: "ぜったい",
      options: ["zettai", "zetai", "zentai", "zettei"],
      answer: "zettai",
    },
    {
      q: "じっしゅうせい",
      options: ["jissyuusei", "jissyuuse", "jisyuusei", "jisyusei"],
      answer: "jissyuusei",
    },
    {
      q: "はっぴょう",
      options: ["happyou", "happio", "hapyou", "happuo"],
      answer: "happyou",
    },
    {
      q: "きっさてん",
      options: ["kissaten", "kiisaten", "kisatten", "kissatei"],
      answer: "kissaten",
    },
    {
      q: "totte",
      options: ["とって", "とてい", "とてっ", "とってえ"],
      answer: "とって",
    },
    {
      q: "kekka",
      options: ["けっか", "けいか", "けか", "けっこ"],
      answer: "けっか",
    },
    {
      q: "dakko",
      options: ["だっこ", "だこう", "だくこ", "だっこう"],
      answer: "だっこ",
    },
    {
      q: "sekken",
      options: ["せっけん", "せけっん", "せっけい", "せけん"],
      answer: "せっけん",
    },
    {
      q: "tassei",
      options: ["たっせい", "たっせえ", "たあせい", "たすせい"],
      answer: "たっせい",
    },
    {
      q: "kippu",
      options: ["きっぷ", "かっぷ", "こっぷ", "けっぷ"],
      answer: "きっぷ",
    },
    {
      q: "kekkon",
      options: ["けっこん", "けこおん", "けこっん", "けっこう"],
      answer: "けっこん",
    },
    {
      q: "bukka",
      options: ["ぶっか", "ふうか", "ぶっかあ", "ぶっくあ"],
      answer: "ぶっか",
    },
    {
      q: "kesshou",
      options: ["けっしょう", "けしょう", "けっしゅう", "けしゅう"],
      answer: "けっしょう",
    },
    {
      q: "roppyaku",
      options: ["ろっぴゃく", "ろぴやく", "ろっぱく", "ろっぴゃあく"],
      answer: "ろっぴゃく",
    },
    {
      q: "テニス",
      options: ["tenisu", "teniso", "tanisu", "tanosu"],
      answer: "tenisu",
    },
    { q: "アイス", options: ["aisu", "ausu", "aiso", "auso"], answer: "aisu" },
    {
      q: "インク",
      options: ["inku", "isoki", "inke", "isoko"],
      answer: "inku",
    },
    {
      q: "カメラ",
      options: ["kamera", "kamaru", "kanara", "kanero"],
      answer: "kamera",
    },
    {
      q: "ソフト",
      options: ["sohuto", "nohuto", "sokuto", "nokute"],
      answer: "sohuto",
    },
    {
      q: "チャンス",
      options: ["chansu", "chinsu", "chassu", "chinsu"],
      answer: "chansu",
    },
    {
      q: "ナイフ",
      options: ["naihu", "naiku", "maihu", "maiku"],
      answer: "naihu",
    },
    {
      q: "ノック",
      options: ["nokku", "nooku", "notta", "nocchi"],
      answer: "nokku",
    },
    {
      q: "ハンドル",
      options: ["handoru", "hantore", "handaru", "hantoro"],
      answer: "handoru",
    },
    {
      q: "ポスト",
      options: ["posuto", "bosuto", "posute", "bosate"],
      answer: "posuto",
    },
    {
      q: "ajia",
      options: ["アジア", "アシア", "アギア", "アゼア"],
      answer: "アジア",
    },
    {
      q: "gaido",
      options: ["ガイド", "ギャイド", "アイド", "ゴイド"],
      answer: "ガイド",
    },
    {
      q: "kuizu",
      options: ["クイズ", "クイザ", "タイス", "タイズ"],
      answer: "クイズ",
    },
    {
      q: "sarada",
      options: ["サラダ", "サウゲ", "サラグ", "サクダ"],
      answer: "サラダ",
    },
    {
      q: "shatsu",
      options: ["シャツ", "ツャシ", "ミャツ", "シャミ"],
      answer: "シャツ",
    },
    {
      q: "hankachi",
      options: ["ハンカチ", "ハソカタ", "ハンケナ", "ハンカキ"],
      answer: "ハンカチ",
    },
    {
      q: "hinto",
      options: ["ヒント", "ハント", "ヒイト", "ハンメ"],
      answer: "ヒント",
    },
    {
      q: "botan",
      options: ["ボタン", "ポタン", "バタン", "ビタン"],
      answer: "ボタン",
    },
    {
      q: "renji",
      options: ["レンジ", "レンゾ", "レソジ", "レノゾ"],
      answer: "レンジ",
    },
    {
      q: "wain",
      options: ["ワイン", "クイン", "ワレン", "クレソ"],
      answer: "ワイン",
    },
    {
      q: "カード",
      options: ["kaado", "kadoo", "kaddo", "kaidou"],
      answer: "kaado",
    },
    {
      q: "クーラー",
      options: ["kuuraa", "kuraa", "kuuree", "kooraa"],
      answer: "kuuraa",
    },
    {
      q: "コーチ",
      options: ["koochi", "kocchi", "kooichi", "kuuchi"],
      answer: "koochi",
    },
    {
      q: "シャワー",
      options: ["shawaa", "shawa", "shawwa", "shawoo"],
      answer: "shawaa",
    },
    {
      q: "スタート",
      options: ["sutaato", "suttatto", "sutatto", "suttaato"],
      answer: "sutaato",
    },
    {
      q: "タクシー",
      options: ["takushii", "takushi", "takusshi", "takuushi"],
      answer: "takushii",
    },
    {
      q: "テーブル",
      options: ["teeburu", "tebuuru", "tebburu", "teebuuru"],
      answer: "teeburu",
    },
    {
      q: "キーボード",
      options: ["kiiboodo", "kiiboddo", "kibboodo", "kiboddo"],
      answer: "kiiboodo",
    },
    {
      q: "マッサージ",
      options: ["massaaji", "masaaji", "massaji", "massajji"],
      answer: "massaaji",
    },
    {
      q: "ヨーロッパ",
      options: ["yooroppa", "yoropaa", "yooroppu", "yorropu"],
      answer: "yooroppa",
    },
    {
      q: "imeeji",
      options: ["イメージ", "イメッジ", "イメジー", "イーメジ"],
      answer: "イメージ",
    },
    {
      q: "oopun",
      options: ["オープン", "オプーン", "オップン", "オーップン"],
      answer: "オープン",
    },
    {
      q: "sakkaa",
      options: ["サッカー", "サカー", "サッカ", "サッカア"],
      answer: "サッカー",
    },
    {
      q: "guruupu",
      options: ["グループ", "グルプ", "グルップ", "グループー"],
      answer: "グループ",
    },
    {
      q: "konsaato",
      options: ["コンサート", "コサート", "コンサット", "コンサイト"],
      answer: "コンサート",
    },
    {
      q: "shattaa",
      options: ["シャッター", "シッター", "シャター", "シャッタ"],
      answer: "シャッター",
    },
    {
      q: "supiikaa",
      options: ["スピーカー", "スピカー", "スピーカ", "スピッカー"],
      answer: "スピーカー",
    },
    {
      q: "nyuusu",
      options: ["ニュース", "ヌース", "ミュース", "ニース"],
      answer: "ニュース",
    },
    {
      q: "batterii",
      options: ["バッテリー", "バテリー", "バッテリ", "バーテリー"],
      answer: "バッテリー",
    },
    {
      q: "boorupen",
      options: ["ボールペン", "ボルーペン", "ボールペ", "ボッルペン"],
      answer: "ボールペン",
    },
    {
      q: "チェック",
      options: ["chekku", "chakku", "chuku", "cheiku"],
      answer: "chekku",
    },
    { q: "ティー", options: ["tii", "tee", "chee", "chii"], answer: "tii" },
    {
      q: "ファイル",
      options: ["fairu", "hairu", "huiru", "hyairu"],
      answer: "fairu",
    },
    {
      q: "ウィルス",
      options: ["wirusu", "urusu", "virusu", "wurusu"],
      answer: "wirusu",
    },
    {
      q: "フォント",
      options: ["fonto", "honto", "finto", "hunto"],
      answer: "fonto",
    },
    {
      q: "ポルシェ",
      options: ["porushe", "porushi", "porusho", "poruse"],
      answer: "porushe",
    },
    {
      q: "ウェイト",
      options: ["weito", "uito", "wuito", "eito"],
      answer: "weito",
    },
    {
      q: "ファウル",
      options: ["fauru", "huuru", "fairu", "hauru"],
      answer: "fauru",
    },
    {
      q: "ヴィーナス",
      options: ["viinasu", "wiinasu", "vonasu", "wonasu"],
      answer: "viinasu",
    },
    {
      q: "ヴォーカル",
      options: ["vookaru", "wookaru", "bookaru", "vuukaru"],
      answer: "vookaru",
    },
    {
      q: "wootaa",
      options: ["ウォーター", "ヲーター", "ウィーター", "ウーター"],
      answer: "ウォーター",
    },
    {
      q: "wisukii",
      options: ["ウィスキー", "ウスキー", "ヴィスキー", "ウェスキー"],
      answer: "ウィスキー",
    },
    {
      q: "shea",
      options: ["シェア", "シア", "シャア", "シュア"],
      answer: "シェア",
    },
    {
      q: "firipin",
      options: ["フィリピン", "ヒリピン", "フリピン", "ファリピン"],
      answer: "フィリピン",
    },
    {
      q: "jetto",
      options: ["ジェット", "ジット", "ジャット", "ジョット"],
      answer: "ジェット",
    },
    {
      q: "wookingu",
      options: ["ウォーキング", "ウィーキング", "オーキング", "ヴォーキング"],
      answer: "ウォーキング",
    },
    {
      q: "firumu",
      options: ["フィルム", "ヒルム", "ヒールム", "フィールム"],
      answer: "フィルム",
    },
    { q: "ivu", options: ["イヴ", "イブ", "イウ", "イグ"], answer: "イヴ" },
    {
      q: "faito",
      options: ["ファイト", "フェイト", "フォイト", "ファート"],
      answer: "ファイト",
    },
    {
      q: "vaikingu",
      options: ["ヴァイキング", "ビャイキング", "ファイキング", "ウァイキング"],
      answer: "ヴァイキング",
    },
  ],
  "表記（中盤レベル[7〜17か]）": [
    {
      q: "うちの　外は　とても　さむいです。",
      options: ["そと", "がい", "すと", "なか"],
      answer: "そと",
    },
    {
      q: "どの国の　りょうりが　すきですか。",
      options: ["くに", "こく", "ごく", "ぐに"],
      answer: "くに",
    },
    {
      q: "その　男の子は　十さいです。",
      options: ["おとこ", "おんな", "うとこ", "おとく"],
      answer: "おとこ",
    },
    {
      q: "女の　人の　シャツが　ありますか。",
      options: ["おんな", "おとこ", "おんね", "おんの"],
      answer: "おんな",
    },
    {
      q: "むす子さんの　おなまえは？",
      options: ["こ", "ご", "く", "こう"],
      answer: "こ",
    },
    {
      q: "英語の　うたが　へたです。",
      options: ["えい", "え", "ええ", "えん"],
      answer: "えい",
    },
    {
      q: "ちいさい　子どもの　ふくを　かいます。",
      options: ["こ", "く", "か", "ご"],
      answer: "こ",
    },
    {
      q: "今や　レストランで　女の　ともだちに　あいます。",
      options: ["おんな", "おとこ", "じょ", "おな"],
      answer: "おんな",
    },
    {
      q: "あの　男の　先生が　おしえます。",
      options: ["おとこ", "おんな", "うとこ", "あとこ"],
      answer: "おとこ",
    },
    {
      q: "中国の　おみやげを　もらいました。",
      options: ["ごく", "くに", "こく", "くご"],
      answer: "ごく",
    },
    {
      q: "がい国語を　べんきょうしますか。",
      options: ["外", "多", "タ", "名"],
      answer: "外",
    },
    {
      q: "かんこく語が　わかりますか。",
      options: ["国", "田", "因", "四"],
      answer: "国",
    },
    {
      q: "ここは　おとこの　人の　りょうです。",
      options: ["男", "思", "界", "黒"],
      answer: "男",
    },
    {
      q: "あの　おんなの　子は　どなたの　お子さんですか。",
      options: ["女", "大", "母", "又"],
      answer: "女",
    },
    {
      q: "こどもの　チケットは　いくらですか。",
      options: ["子", "孔", "仔", "手"],
      answer: "子",
    },
    {
      q: "まい日　えい語の　えいがを　みます。",
      options: ["英", "草", "漢", "央"],
      answer: "英",
    },
    {
      q: "おくには　どちらですか。",
      options: ["国", "口", "囲", "回"],
      answer: "国",
    },
    {
      q: "きょうしつの　そとで　本を　よみます。",
      options: ["外", "舛", "ト", "汐"],
      answer: "外",
    },
    {
      q: "おとこの　ネクタイを　かりました。",
      options: ["男", "女", "侽", "娚"],
      answer: "男",
    },
    {
      q: "おんなの　人と　コンサートに　行きます。",
      options: ["女", "男", "汝", "叉"],
      answer: "女",
    },
    {
      q: "今日　ぎん行は　休みです。",
      options: ["やす", "ゆす", "きゅう", "よす"],
      answer: "やす",
    },
    {
      q: "ゆうめいな　レストランで　食べました。",
      options: ["た", "て", "と", "あ"],
      answer: "た",
    },
    {
      q: "かんじを　たくさん　書きます。",
      options: ["か", "く", "こ", "き"],
      answer: "か",
    },
    {
      q: "スポーツは　ぜんぜん　見ません。",
      options: ["み", "む", "き", "い"],
      answer: "み",
    },
    {
      q: "クラシックの　おんがくを　聞きます。",
      options: ["き", "か", "く", "け"],
      answer: "き",
    },
    {
      q: "日本語の　本を　まいばん　読みます。",
      options: ["よ", "ゆ", "や", "あ"],
      answer: "よ",
    },
    {
      q: "これから　ははに　でん話を　かけます。",
      options: ["わ", "あ", "はなし", "な"],
      answer: "わ",
    },
    {
      q: "ときどき　あさごはんを　食べません。",
      options: ["た", "か", "さ", "な"],
      answer: "た",
    },
    {
      q: "きのう　がっこうを　休みました。",
      options: ["やす", "きゅう", "やつ", "いす"],
      answer: "やす",
    },
    {
      q: "じを　じょうずに　書きます。",
      options: ["か", "しょ", "た", "ま"],
      answer: "か",
    },
    {
      q: "ひるやすみは　一時から　です。",
      options: ["休", "体", "木", "本"],
      answer: "休",
    },
    {
      q: "しょくどうは　二かい　です。",
      options: ["食", "今", "良", "貧"],
      answer: "食",
    },
    {
      q: "きっさてんで　レポートを　かきます。",
      options: ["書", "車", "電", "君"],
      answer: "書",
    },
    {
      q: "その　あおい　くつを　みせてください。",
      options: ["見", "早", "目", "貝"],
      answer: "見",
    },
    {
      q: "まい日　しんぶんを　読みます。",
      options: ["聞", "間", "問", "門"],
      answer: "聞",
    },
    {
      q: "りょうしんからの　てがみを　よみます。",
      options: ["読", "売", "話", "託"],
      answer: "読",
    },
    {
      q: "これから　おせわに　なります。",
      options: ["話", "語", "言", "舌"],
      answer: "話",
    },
    {
      q: "先生の　おもしろい　はなしを　聞きました。",
      options: ["話", "括", "詰", "辞"],
      answer: "話",
    },
    {
      q: "すきな　たべものは　何ですか。",
      options: ["食", "飲", "貪", "会"],
      answer: "食",
    },
    {
      q: "こうえんで　おはなみを　します。",
      options: ["見", "思", "兄", "貞"],
      answer: "見",
    },
    {
      q: "おてあらいは　ちか　一かい　です。",
      options: ["いっ", "いち", "いつ", "ひと"],
      answer: "いっ",
    },
    {
      q: "けんくんは　二さい　です。",
      options: ["に", "ふた", "にん", "にい"],
      answer: "に",
    },
    {
      q: "らいげつは　三がつ　です。",
      options: ["さん", "み", "みっ", "さ"],
      answer: "さん",
    },
    {
      q: "まいばん　がっこうから　四じに　かえります。",
      options: ["よ", "し", "よん", "よっ"],
      answer: "よ",
    },
    {
      q: "五えんを　みせてください。",
      options: ["ご", "いつ", "ごう", "ごっ"],
      answer: "ご",
    },
    {
      q: "じむしょは　六かい　です。",
      options: ["ろっ", "ろく", "むつ", "むい"],
      answer: "ろっ",
    },
    {
      q: "いま　七じ　です。",
      options: ["しち", "なな", "なの", "ななっ"],
      answer: "しち",
    },
    {
      q: "あしたは　八か　です。",
      options: ["よう", "はち", "や", "やつ"],
      answer: "よう",
    },
    {
      q: "きのう　九じに　ねました。",
      options: ["く", "きゅう", "ここの", "くう"],
      answer: "く",
    },
    {
      q: "四ぷん　やすみました。",
      options: ["よん", "よ", "し", "よっ"],
      answer: "よん",
    },
    {
      q: "これは　いちえんです。",
      options: ["一", "二", "七", "三"],
      answer: "一",
    },
    {
      q: "にばんせんに　でんしゃが　きます。",
      options: ["二", "一", "三", "八"],
      answer: "二",
    },
    {
      q: "かいしゃは　さんかい　です。",
      options: ["三", "五", "九", "六"],
      answer: "三",
    },
    {
      q: "こんげつは　しがつです。",
      options: ["四", "三", "一", "五"],
      answer: "四",
    },
    {
      q: "ごふん　やすみます。",
      options: ["五", "七", "二", "九"],
      answer: "五",
    },
    {
      q: "ことし　６さい　です。",
      options: ["六", "八", "七", "十"],
      answer: "六",
    },
    {
      q: "ななかいは　しょくどう　です。",
      options: ["七", "一", "五", "九"],
      answer: "七",
    },
    {
      q: "まいあさ　はちじから　はたらきます。",
      options: ["八", "六", "十", "一"],
      answer: "八",
    },
    {
      q: "たんじょうびは　ここのか　です。",
      options: ["九", "五", "十", "二"],
      answer: "九",
    },
    {
      q: "この　デパートは　ふつかまで　やすみです。",
      options: ["二", "六", "九", "四"],
      answer: "二",
    },
    {
      q: "十ぷん　やすみます。",
      options: ["じゅっ", "じゅう", "とお", "じゅ"],
      answer: "じゅっ",
    },
    {
      q: "日ほんごを　べんきょうします。",
      options: ["に", "にち", "じつ", "ひ"],
      answer: "に",
    },
    {
      q: "せん月　アメリカから　きました。",
      options: ["げつ", "つき", "がつ", "づき"],
      answer: "げつ",
    },
    {
      q: "火ようびは　あるいて　かいしゃに　いきます。",
      options: ["か", "ひ", "かあ", "ひい"],
      answer: "か",
    },
    {
      q: "水ようびに　かばんを　かいました。",
      options: ["すい", "みず", "ずい", "みす"],
      answer: "すい",
    },
    {
      q: "木ようびに　レストランで　さかなを　たべました。",
      options: ["もく", "き", "ぼく", "こ"],
      answer: "もく",
    },
    {
      q: "金ようびは　ひとりで　おさけを　のみます。",
      options: ["きん", "かね", "こん", "かな"],
      answer: "きん",
    },
    {
      q: "土ようびに　テニスを　します。",
      options: ["ど", "と", "つち", "どう"],
      answer: "ど",
    },
    {
      q: "十日は　やすみです。",
      options: ["か", "にち", "じつ", "ひ"],
      answer: "か",
    },
    {
      q: "この　デパートは　じゅうじまで　です。",
      options: ["十", "六", "九", "八"],
      answer: "十",
    },
    {
      q: "まいにち　こめを　たべます。",
      options: ["日", "月", "木", "金"],
      answer: "日",
    },
    {
      q: "四がつに　おはなみを　します。",
      options: ["月", "木", "火", "日"],
      answer: "月",
    },
    {
      q: "かようびに　せんせいに　しゅくだいを　ききました。",
      options: ["火", "金", "日", "木"],
      answer: "火",
    },
    {
      q: "スーパーで　みずを　かいます。",
      options: ["水", "火", "日", "木"],
      answer: "水",
    },
    {
      q: "もくようびは　いつも　ともだちと　レポートを　かきます。",
      options: ["木", "金", "月", "日"],
      answer: "木",
    },
    {
      q: "きんようびの　よる　えいがを　みます。",
      options: ["金", "水", "土", "火"],
      answer: "金",
    },
    {
      q: "どよう日に　ともだちに　あいました。",
      options: ["土", "水", "火", "金"],
      answer: "土",
    },
    {
      q: "まいばん　じゅうじに　ねます。",
      options: ["十", "一", "土", "九"],
      answer: "十",
    },
    {
      q: "らいげつ　くにに　かえります。",
      options: ["月", "土", "水", "木"],
      answer: "月",
    },
    {
      q: "たんじょうびは　いつですか。",
      options: ["日", "月", "土", "金"],
      answer: "日",
    },
    {
      q: "せんせいに　この本を　かりました。",
      options: ["ほん", "もと", "ぼん", "ぽん"],
      answer: "ほん",
    },
    {
      q: "あのかたは　リーさんの　ごしゅ人です。",
      options: ["じん", "にん", "ひと", "しん"],
      answer: "じん",
    },
    {
      q: "うけつけは　何がい　ですか。",
      options: ["なん", "なに", "か", "ねに"],
      answer: "なん",
    },
    {
      q: "だい学まで　あるいて　いきます。",
      options: ["がく", "かく", "ごく", "がこ"],
      answer: "がく",
    },
    {
      q: "おとうとは　まだ　学生です。",
      options: ["せい", "しょう", "ぜい", "う"],
      answer: "せい",
    },
    {
      q: "わたしの　先生は　きょう　やすみです。",
      options: ["せん", "さき", "ぜん", "せい"],
      answer: "せん",
    },
    {
      q: "日本語の　きょうしつは　どこ　ですか。",
      options: ["ご", "ごう", "ぐ", "こ"],
      answer: "ご",
    },
    {
      q: "今　何じ　ですか。",
      options: ["いま", "こん", "いむ", "この"],
      answer: "いま",
    },
    {
      q: "きのう　ビールを　三本　のみました。",
      options: ["ぼん", "ほん", "ぽん", "もと"],
      answer: "ぼん",
    },
    {
      q: "人が　きました。",
      options: ["ひと", "にん", "じん", "びと"],
      answer: "ひと",
    },
    {
      q: "今月は　クリスマスです。",
      options: ["こん", "いま", "せん", "こ"],
      answer: "こん",
    },
    {
      q: "かさを　いっぽん　あげました。",
      options: ["本", "木", "休", "米"],
      answer: "本",
    },
    {
      q: "あのひとは　エンジニアです。",
      options: ["人", "入", "ノ", "大"],
      answer: "人",
    },
    {
      q: "あのかたは　なに人　ですか。",
      options: ["何", "向", "回", "同"],
      answer: "何",
    },
    {
      q: "わたしの　ちちは　だいがくの　きょうしです。",
      options: ["学", "栄", "蛍", "覚"],
      answer: "学",
    },
    {
      q: "その　学せいは　いつ　日本に　きましたか。",
      options: ["生", "牛", "午", "先"],
      answer: "生",
    },
    {
      q: "せん月　りょうしんに　プレゼントを　おくりました。",
      options: ["先", "生", "洗", "午"],
      answer: "先",
    },
    {
      q: "えいごで　えいがを　みます。",
      options: ["語", "話", "吾", "言"],
      answer: "語",
    },
    {
      q: "こんばん　かぞくに　でんわを　かけます。",
      options: ["今", "含", "会", "合"],
      answer: "今",
    },
    {
      q: "つぎの　でんしゃは　なんばんせんに　きますか。",
      options: ["何", "洞", "尚", "回"],
      answer: "何",
    },
    {
      q: "この　バスは　どこに　行きますか。",
      options: ["い", "こう", "え", "ぎょう"],
      answer: "い",
    },
    {
      q: "今年の　ふゆは　さむいです。",
      options: ["とし", "ねん", "たし", "にん"],
      answer: "とし",
    },
    {
      q: "おてあらいは　うけつけの　右で　ございます。",
      options: ["みぎ", "ひだり", "した", "なか"],
      answer: "みぎ",
    },
    {
      q: "あのくるまの　左の　かたは　どなた　ですか。",
      options: ["ひだり", "みぎ", "さ", "ひだれ"],
      answer: "ひだり",
    },
    {
      q: "上の　おこさんは　何さい　ですか。",
      options: ["うえ", "した", "じょう", "うわ"],
      answer: "うえ",
    },
    {
      q: "デパートの　ち下で　たべます。",
      options: ["か", "した", "うえ", "じょう"],
      answer: "か",
    },
    {
      q: "だい学で　中ごく語を　おしえます。",
      options: ["ちゅう", "なか", "ちゅん", "じゅう"],
      answer: "ちゅう",
    },
    {
      q: "その　右の　おさけは　とても　たかいです。",
      options: ["みぎ", "ひだり", "むぎ", "にぎ"],
      answer: "みぎ",
    },
    {
      q: "きょ年の　たんじょうびは　ドイツの　チョコレートを　もらいました。",
      options: ["ねん", "とし", "どし", "にん"],
      answer: "ねん",
    },
    {
      q: "きょうしつの　中は　あついです。",
      options: ["なか", "うえ", "した", "じゅう"],
      answer: "なか",
    },
    {
      q: "りょこうは　どうでしたか。",
      options: ["行", "〒", "迂", "征"],
      answer: "行",
    },
    {
      q: "らいねん　フランスに　行きます。",
      options: ["年", "幸", "干", "手"],
      answer: "年",
    },
    {
      q: "その　みぎの　あおい　シャツを　みせてください。",
      options: ["右", "左", "石", "后"],
      answer: "右",
    },
    {
      q: "ひだりてで　きります。",
      options: ["左", "石", "右", "庄"],
      answer: "左",
    },
    {
      q: "やまの　うえの　さくらは　きれいです。",
      options: ["上", "下", "土", "士"],
      answer: "上",
    },
    {
      q: "かいだんで　一かい　したに　行ってください。",
      options: ["下", "不", "上", "木"],
      answer: "下",
    },
    {
      q: "きょ年　ちゅうごくから　日本に　きました。",
      options: ["中", "串", "申", "四"],
      answer: "中",
    },
    {
      q: "このエスカレーターは　うえに　行きます。",
      options: ["上", "下", "ト", "王"],
      answer: "上",
    },
    {
      q: "このにもつの　なかに　プレゼントが　あります。",
      options: ["中", "仲", "車", "右"],
      answer: "中",
    },
    {
      q: "ちかてつで　びょういんから　かえりました。",
      options: ["下", "上", "ト", "十"],
      answer: "下",
    },
    {
      q: "うちの　外は　とても　さむいです。",
      options: ["そと", "がい", "すと", "なか"],
      answer: "そと",
    },
    {
      q: "どの国の　りょうりが　すきですか。",
      options: ["くに", "こく", "ごく", "ぐに"],
      answer: "くに",
    },
    {
      q: "その　男の子は　十さいです。",
      options: ["おとこ", "おんな", "うとこ", "おとく"],
      answer: "おとこ",
    },
    {
      q: "女の　人の　シャツが　ありますか。",
      options: ["おんな", "おとこ", "おんね", "おんの"],
      answer: "おんな",
    },
    {
      q: "むす子さんの　おなまえは？",
      options: ["こ", "ご", "く", "こう"],
      answer: "こ",
    },
    {
      q: "英語の　うたが　へたです。",
      options: ["えい", "え", "ええ", "えん"],
      answer: "えい",
    },
    {
      q: "ちいさい　子どもの　ふくを　かいます。",
      options: ["こ", "く", "か", "ご"],
      answer: "こ",
    },
    {
      q: "今や　レストランで　女の　ともだちに　あいます。",
      options: ["おんな", "おとこ", "じょ", "おな"],
      answer: "おんな",
    },
    {
      q: "あの　男の　先生が　おしえます。",
      options: ["おとこ", "おんな", "うとこ", "あとこ"],
      answer: "おとこ",
    },
    {
      q: "中国の　おみやげを　もらいました。",
      options: ["ごく", "くに", "こく", "くご"],
      answer: "ごく",
    },
    {
      q: "がい国語を　べんきょうしますか。",
      options: ["外", "多", "タ", "名"],
      answer: "外",
    },
    {
      q: "かんこく語が　わかりますか。",
      options: ["国", "田", "因", "四"],
      answer: "国",
    },
    {
      q: "ここは　おとこの　人の　りょうです。",
      options: ["男", "思", "界", "黒"],
      answer: "男",
    },
    {
      q: "あの　おんなの　子は　どなたの　お子さんですか。",
      options: ["女", "大", "母", "又"],
      answer: "女",
    },
    {
      q: "こどもの　チケットは　いくらですか。",
      options: ["子", "孔", "仔", "手"],
      answer: "子",
    },
    {
      q: "まい日　えい語の　えいがを　みます。",
      options: ["英", "草", "漢", "央"],
      answer: "英",
    },
    {
      q: "おくには　どちらですか。",
      options: ["国", "口", "囲", "回"],
      answer: "国",
    },
    {
      q: "きょうしつの　そとで　本を　よみます。",
      options: ["外", "舛", "ト", "汐"],
      answer: "外",
    },
    {
      q: "おとこの　ネクタイを　かりました。",
      options: ["男", "女", "侽", "娚"],
      answer: "男",
    },
    {
      q: "おんなの　人と　コンサートに　行きます。",
      options: ["女", "男", "汝", "叉"],
      answer: "女",
    },
  ],
  "表記（後半レベル[18〜27か]）": [
    {
      q: "大学で　スペイン語を　べんきょうします。",
      options: ["だい", "たい", "おお", "でい"],
      answer: "だい",
    },
    {
      q: "ここは　小さい　まちです。",
      options: ["ちい", "しょう", "こ", "お"],
      answer: "ちい",
    },
    {
      q: "高い　やきにくを　食べました。",
      options: ["たか", "こう", "だか", "てか"],
      answer: "たか",
    },
    {
      q: "国の　[友]だちに　はがきを　おくります。",
      options: ["とも", "ゆう", "とむ", "たも"],
      answer: "とも",
    },
    {
      q: "そ父と　ちかくの　こうえんに　行きます。",
      options: ["ふ", "ちち", "とう", "ぼ"],
      answer: "ふ",
    },
    {
      q: "母は　カラオケが　上ずです。",
      options: ["はは", "ちち", "ほほ", "ばば"],
      answer: "はは",
    },
    {
      q: "毎あさ　コーヒーを　のみます。",
      options: ["まい", "めい", "まん", "まん"],
      answer: "まい",
    },
    {
      q: "この　パソコンは　高かったです。",
      options: ["たか", "やす", "おおき", "たた"],
      answer: "たか",
    },
    {
      q: "たろうくんの　お母さんの　おなまえは？",
      options: ["かあ", "はは", "とう", "ばあ"],
      answer: "かあ",
    },
    {
      q: "父の　たんじょう日に　とけいを　あげます。",
      options: ["ちち", "はは", "しし", "じじ"],
      answer: "ちち",
    },
    {
      q: "おおきい　りんごを　たくさん　もらいました。",
      options: ["大", "小", "太", "犬"],
      answer: "大",
    },
    {
      q: "本やの　まえに　ちいさい　ねこが　います。",
      options: ["小", "人", "少", "尖"],
      answer: "小",
    },
    {
      q: "あの　たかい　ビルの　中に　かいしゃが　あります。",
      options: ["高", "何", "向", "亭"],
      answer: "高",
    },
    {
      q: "ともだちに　えんぴつを　かりました。",
      options: ["友", "女", "石", "又"],
      answer: "友",
    },
    {
      q: "リーさんの　おとうさんは　いしゃです。",
      options: ["父", "大", "母", "叉"],
      answer: "父",
    },
    {
      q: "マイクさんの　おかあさんの　りょうりは　おいしいです。",
      options: ["母", "父", "苺", "毎"],
      answer: "母",
    },
    {
      q: "まい日　さかなを　食べません。",
      options: ["毎", "母", "悔", "田"],
      answer: "毎",
    },
    {
      q: "そふは　とても　げんきです。",
      options: ["父", "母", "兄", "弟"],
      answer: "父",
    },
    {
      q: "だい学の　きょうしは　何人いますか。",
      options: ["大", "入", "小", "イ"],
      answer: "大",
    },
    {
      q: "そぼは　たっきゅうが　すきです。",
      options: ["母", "姉", "妹", "父"],
      answer: "母",
    },
    {
      q: "日本語学校で　日本語を　ならいます。",
      options: ["こう", "くう", "こお", "こん"],
      answer: "こう",
    },
    {
      q: "今、　何時ですか。",
      options: ["じ", "とき", "ぢ", "どき"],
      answer: "じ",
    },
    {
      q: "ビルの　間に　小さい　いぬが　います。",
      options: ["あいだ", "ま", "かん", "あえだ"],
      answer: "あいだ",
    },
    {
      q: "うちから　えきまで　じてんしゃで　１０分です。",
      options: ["ぷん", "ぶん", "ふん", "ぶ"],
      answer: "ぷん",
    },
    {
      q: "ひる休みは　１時半までです。",
      options: ["はん", "ほん", "ふん", "ばん"],
      answer: "はん",
    },
    {
      q: "くうこうの　前に　ホテルが　あります。",
      options: ["まえ", "まい", "ぜん", "みえ"],
      answer: "まえ",
    },
    {
      q: "きっさてんの　後ろに　ポストが　あります。",
      options: ["うし", "ご", "あと", "おし"],
      answer: "うし",
    },
    {
      q: "毎日　午前８時から　はたらきます。",
      options: ["ぜん", "まえ", "せん", "ご"],
      answer: "ぜん",
    },
    {
      q: "オーストラリアまで　ひこうきで　何時間かかりますか。",
      options: ["かん", "あいだ", "こん", "くん"],
      answer: "かん",
    },
    {
      q: "えいごの　しけんは　４５分です。",
      options: ["ふん", "ぷん", "ぶん", "ふ"],
      answer: "ふん",
    },
    {
      q: "学こうの　なつ休みは　らい月からです。",
      options: ["校", "交", "梅", "桜"],
      answer: "校",
    },
    {
      q: "ときどき　さかなを　たべます。",
      options: ["時", "寺", "映", "待"],
      answer: "時",
    },
    {
      q: "やくそくの　時かんです。",
      options: ["間", "門", "闇", "関"],
      answer: "間",
    },
    {
      q: "ここから　えきまで　あるいて　２０ぷん　かかります。",
      options: ["分", "父", "公", "六"],
      answer: "分",
    },
    {
      q: "毎ばん　午後１１時はんに　ねます。",
      options: ["半", "牛", "未", "羊"],
      answer: "半",
    },
    {
      q: "午ぜん中は　あめでした。",
      options: ["前", "煎", "揃", "削"],
      answer: "前",
    },
    {
      q: "きのうの　午ごは　すずしかったです。",
      options: ["後", "行", "待", "援"],
      answer: "後",
    },
    {
      q: "ご後　おまつりは　人が　おおかったです。",
      options: ["午", "末", "矢", "牛"],
      answer: "午",
    },
    {
      q: "本やと　ラーメンやの　あいだの　やきにくやに　行きます。",
      options: ["間", "閑", "開", "閏"],
      answer: "間",
    },
    {
      q: "この　えいがは　２時間１５ふんです。",
      options: ["分", "八", "刀", "力"],
      answer: "分",
    },
    {
      q: "大学の　名前を　おしえてください。",
      options: ["な", "めい", "みょう", "ね"],
      answer: "な",
    },
    {
      q: "あたらしい　車を　かいました。",
      options: ["くるま", "しゃ", "くろま", "じゃ"],
      answer: "くるま",
    },
    {
      q: "い間に　白い　テーブルが　あります。",
      options: ["しろ", "すろ", "しる", "はく"],
      answer: "しろ",
    },
    {
      q: "コーヒーは　三百円です。",
      options: ["びゃく", "ひゃく", "ひょく", "びょく"],
      answer: "びゃく",
    },
    {
      q: "三千字の　レポートを　よみます。",
      options: ["ぜん", "せん", "さん", "ざん"],
      answer: "ぜん",
    },
    {
      q: "二万だいの　じてんしゃが　あります。",
      options: ["まん", "もん", "むん", "めん"],
      answer: "まん",
    },
    {
      q: "この　えいがの　チケットは　五百円です。",
      options: ["えん", "いえん", "いん", "ゆん"],
      answer: "えん",
    },
    {
      q: "千時間　およぎました。",
      options: ["せん", "ぜん", "せむ", "さん"],
      answer: "せん",
    },
    {
      q: "白い　ゆきが　きれいです。",
      options: ["しろ", "じろ", "はく", "ひゃく"],
      answer: "しろ",
    },
    {
      q: "六百円の　てい食を　食べます。",
      options: ["ぴゃく", "ひゃく", "ぴょく", "びゃく"],
      answer: "ぴゃく",
    },
    {
      q: "この　おてらは　ゆうめいです。",
      options: ["名", "多", "茗", "各"],
      answer: "名",
    },
    {
      q: "じどうしゃの　ざっしを　かります。",
      options: ["車", "電", "東", "串"],
      answer: "車",
    },
    {
      q: "この　しろい　さしみは　何ですか。",
      options: ["白", "百", "日", "由"],
      answer: "白",
    },
    {
      q: "ひゃく人の　学生が　います。",
      options: ["百", "白", "甘", "目"],
      answer: "百",
    },
    {
      q: "せんかい　かんじを　書きます。",
      options: ["千", "十", "干", "士"],
      answer: "千",
    },
    {
      q: "ピザを　一まんまい　つくります。",
      options: ["万", "力", "分", "刀"],
      answer: "万",
    },
    {
      q: "百えんの　おにぎりは　おいしいです。",
      options: ["円", "門", "内", "四"],
      answer: "円",
    },
    {
      q: "あおい　くるまが　ほしいです。",
      options: ["車", "轟", "転", "単"],
      answer: "車",
    },
    {
      q: "つぎの　たんじょう日まで　ひゃく日です。",
      options: ["百", "早", "泊", "伯"],
      answer: "百",
    },
    {
      q: "三ぜん年は　何日ですか。",
      options: ["千", "イ", "チ", "テ"],
      answer: "千",
    },
    {
      q: "先生は　いつも　元気です。",
      options: ["き", "け", "きい", "けい"],
      answer: "き",
    },
    {
      q: "そちらの　天気は　どうですか。",
      options: ["てん", "でん", "たん", "ちん"],
      answer: "てん",
    },
    {
      q: "お子さんは　お元気ですか。",
      options: ["げん", "がん", "もと", "ぎん"],
      answer: "げん",
    },
    {
      q: "今日の　午後から　雨です。",
      options: ["あめ", "あみ", "う", "おめ"],
      answer: "あめ",
    },
    {
      q: "電気を　けしてください。",
      options: ["でん", "じん", "ぜん", "だん"],
      answer: "でん",
    },
    {
      q: "ち下てつの　入ぐちが　わかりますか。",
      options: ["いり", "はいり", "で", "いれ"],
      answer: "いり",
    },
    {
      q: "えきの　出ぐちに　女の子が　一人います。",
      options: ["で", "だ", "ぜ", "でる"],
      answer: "で",
    },
    {
      q: "長い　時間　友だちを　まちました。",
      options: ["なが", "ちょう", "なぐ", "ねが"],
      answer: "なが",
    },
    {
      q: "げんかんから　入ってください。",
      options: ["はい", "い", "にゅう", "はえ"],
      answer: "はい",
    },
    {
      q: "毎あさ　うちを　７時に　出ます。",
      options: ["で", "だ", "だし", "でる"],
      answer: "で",
    },
    {
      q: "こどもが　元きに　あそんでいます。",
      options: ["気", "汽", "氣", "氘"],
      answer: "気",
    },
    {
      q: "てん気の　わるい日は　さんぽを　しません。",
      options: ["天", "大", "夫", "犬"],
      answer: "天",
    },
    {
      q: "かぞくは　みんな　げん気です。",
      options: ["元", "π", "テ", "モ"],
      answer: "元",
    },
    {
      q: "今　あめが　ふっています。",
      options: ["雨", "雲", "雷", "電"],
      answer: "雨",
    },
    {
      q: "かいしゃまで　でん車で　行きます。",
      options: ["電", "雨", "雪", "車"],
      answer: "電",
    },
    {
      q: "きっさてんに　はいりませんか。",
      options: ["入", "人", "へ", "メ"],
      answer: "入",
    },
    {
      q: "もうすこしで　デパートを　でます。",
      options: ["出", "山", "㑁", "泏"],
      answer: "出",
    },
    {
      q: "しんかんせんの　ホームは　ながいです。",
      options: ["長", "镸", "套", "畏"],
      answer: "長",
    },
    {
      q: "そくたつで　てがみを　だしました。",
      options: ["出", "入", "上", "年"],
      answer: "出",
    },
    {
      q: "国の　りょうしんに　でん話を　かけます。",
      options: ["電", "零", "申", "雨"],
      answer: "電",
    },
    {
      q: "うちの　後ろに　ちいさい　山が　あります。",
      options: ["やま", "さん", "かわ", "うみ"],
      answer: "やま",
    },
    {
      q: "この川で　およいではいけません。",
      options: ["かわ", "かあ", "こわ", "くわ"],
      answer: "かわ",
    },
    {
      q: "山田さんは　エンジニアです。",
      options: ["だ", "た", "だん", "で"],
      answer: "だ",
    },
    {
      q: "東きょうは　人が　おおいです。",
      options: ["とう", "とお", "たお", "とん"],
      answer: "とう",
    },
    {
      q: "えきの　西ぐちに　ばいてんが　あります。",
      options: ["にし", "にち", "ねし", "ぬし"],
      answer: "にし",
    },
    {
      q: "東南アジアの　りょうりが　すきです。",
      options: ["なん", "みなみ", "なむ", "ねん"],
      answer: "なん",
    },
    {
      q: "日本の　一ばん　北は　どこですか。",
      options: ["きた", "ほく", "かた", "くた"],
      answer: "きた",
    },
    {
      q: "ベトナムは　ラオスの　東の　国です。",
      options: ["ひがし", "ほがし", "ふがし", "ひぐし"],
      answer: "ひがし",
    },
    {
      q: "川の　さかなが　すきです。",
      options: ["かわ", "うみ", "やま", "みず"],
      answer: "かわ",
    },
    {
      q: "山の　中の　きょうかいで　けっこんしました。",
      options: ["やま", "ゆま", "よま", "あま"],
      answer: "やま",
    },
    {
      q: "ふじさんは　いつも　きれいです。",
      options: ["山", "川", "中", "出"],
      answer: "山",
    },
    {
      q: "かわの　ちかくの　小学校に　行きます。",
      options: ["川", "三", "リ", "山"],
      answer: "川",
    },
    {
      q: "た中は　日本人の　名前で　おおいです。",
      options: ["田", "口", "回", "四"],
      answer: "田",
    },
    {
      q: "そこから　ひがしへ　まっすぐ　あるきます。",
      options: ["東", "車", "菓", "束"],
      answer: "東",
    },
    {
      q: "大さかは　東きょうの　にしに　あります。",
      options: ["西", "四", "酉", "酒"],
      answer: "西",
    },
    {
      q: "日本より　みなみの　国へ　りょ行したいです。",
      options: ["南", "関", "同", "献"],
      answer: "南",
    },
    {
      q: "ほっかいどうは　スキーで　ゆう名です。",
      options: ["北", "南", "東", "西"],
      answer: "北",
    },
    {
      q: "やまの　上は　すこし　すずしいです。",
      options: ["山", "小", "下", "水"],
      answer: "山",
    },
    {
      q: "むす子は　とうきょうに　すんでいます。",
      options: ["東", "先", "男", "英"],
      answer: "東",
    },
    {
      q: "ゆうびんきょくの　きたに　としょかんが　あります。",
      options: ["北", "南", "西", "東"],
      answer: "北",
    },
  ],
  "語彙・文脈規定（中盤レベル[13〜19か]）": [
    {
      q: "りんごが　二ふたつ　と　みかんが　四よっつ　あります。　ぜんぶで　（　　）　です。",
      options: ["むっつ", "いつつ", "やっつ", "ここのつ"],
      answer: "むっつ",
    },
    {
      q: "今月こんげつ　五日いつかから　らい月　四日よっかまで　（　　）　国くにへ　帰かえります。",
      options: ["一いっか月", "一月いちがつ", "一こ月", "一け月"],
      answer: "一いっか月",
    },
    {
      q: "日本にほんで　すきやきを　（　　）　食たべました。",
      options: ["はじめて", "つぎの", "あまり", "まだ"],
      answer: "はじめて",
    },
    {
      q: "きのうの　てんきは　よくなかったです。　（　　）　でした。",
      options: ["あめ", "わるい", "うみ", "くもりな"],
      answer: "あめ",
    },
    {
      q: "あした　友ともだちが　国くにへ　かえりますから　（　　）です。",
      options: ["さびしい", "ふるい", "せまい", "ひろい"],
      answer: "さびしい",
    },
    {
      q: "スーパーで　（　　　　）を　かいに　行いきました。",
      options: ["やさい", "えいが", "じかん", "よてい"],
      answer: "やさい",
    },
    {
      q: "外そとは　あめですから　まどを　（　　）。",
      options: [
        "しめましょうか",
        "あけましょうか",
        "つけましょうか",
        "けしましょうか",
      ],
      answer: "しめましょうか",
    },
    {
      q: "その　（　　）から　出でて　ください。",
      options: ["でぐち", "じゅうしょ", "ちず", "てがみ"],
      answer: "でぐち",
    },
    {
      q: "おとうとは　（　　）　です。　レストランで　りょうりを　つくっています。",
      options: ["ちょうりし", "りようし", "びようし", "かんごし"],
      answer: "ちょうりし",
    },
    {
      q: "すこし　つかれました。　ここに　（　　）　いいですか。",
      options: ["すわっても", "おいても", "つかっても", "うっても"],
      answer: "すわっても",
    },
    {
      q: "あさ　おきて　シャワーを　（　　）から　コーヒーを　飲のみます。",
      options: ["あびて", "入はいって", "おして", "のって"],
      answer: "あびて",
    },
    {
      q: "へやが　（　　）　ですから　電気でんきを　つけてから　入はいります。",
      options: ["くらい", "あかるい", "長ながい", "みじかい"],
      answer: "くらい",
    },
    {
      q: "みせの　入いりぐちで　くつを　（　　）。",
      options: [
        "ぬがなければ　なりません",
        "きなければ　なりません",
        "なくさなければ　なりません",
        "入はいらなければ　なりません",
      ],
      answer: "ぬがなければ　なりません",
    },
    {
      q: "びょういんへ　（　　）を　もって　行いかなければ　なりません。",
      options: ["ほけんしょう", "やけど", "べんぴ", "さむ気け"],
      answer: "ほけんしょう",
    },
    {
      q: "A：うちから　がっこうまで　あるいて　（　　　　　）かかりますか。B：15分(ふん)　ぐらいです。",
      options: ["どのぐらい", "いくつ", "いつ", "どうやって"],
      answer: "どのぐらい",
    },
    {
      q: "わたしは　にほんりょうりで　すしが　（　　　　）すきです。",
      options: ["いちばん", "いっさい", "いちど", "いっかい"],
      answer: "いちばん",
    },
    {
      q: "A：テストは　むずかしかったですか。B：いいえ、　（　　　　）でした。",
      options: ["かんたん", "ゆうめい", "べんり", "きれい"],
      answer: "かんたん",
    },
    {
      q: "しゅうまつ　ともだちの　いえに　（　　　　）に　行(い)きます。",
      options: ["あそび", "もらい", "つかれ", "およぎ"],
      answer: "あそび",
    },
    {
      q: "A：しゅうまつは　なにか　しますか。B：あたらしい　ふくが　ほしいですから、ちかくの　デパートで　（　　　　）します。",
      options: ["かいもの", "けっこん", "しょくじ", "さんぽ"],
      answer: "かいもの",
    },
    {
      q: "A：おなかが　（　　　　　　）ね。B：じゃ、あの　レストランへ　行(い)きましょうか。",
      options: ["すきました", "かわきました", "ありました", "つかれました"],
      answer: "すきました",
    },
    {
      q: "A：（　　　　）が　かわきましたね。B：じゃ、ちかくの　きっさてんへ　行(い)きましょうか。",
      options: ["のど", "あたま", "くち", "おなか"],
      answer: "のど",
    },
    {
      q: "ホテルの　（　　　　）で　およぎました。とても　たのしかったです。",
      options: ["プール", "スーパー", "データ", "カード"],
      answer: "プール",
    },
    {
      q: "A：１（　　　）で　なんようびが　いちばん　ひまですか。B：そうですね、どようびですね。",
      options: ["しゅうかん", "かげつ", "にち", "ようび"],
      answer: "しゅうかん",
    },
    {
      q: "レポートを　5（　　　）　かかなければ　なりません。",
      options: ["まい", "つ", "だい", "にん"],
      answer: "まい",
    },
    {
      q: "わたしは　かぞくが　（　　　）います。ちちと　ははと　あねと　わたしです。",
      options: ["よにん", "よっつ", "よんり", "よんまい"],
      answer: "よにん",
    },
    {
      q: "A：　（　　　）で　いつが　いちばん　すきですか。B：はるが　いちばん　すきです。",
      options: ["きせつ", "てんき", "りょこう", "せかい"],
      answer: "きせつ",
    },
    {
      q: "これから　かぞくが　日本(にほん)へ　きますから、くうこうへ　（　　　）に　 行いきます。",
      options: ["むかえ", "はいり", "もらい", "だし"],
      answer: "むかえ",
    },
    {
      q: "（タクシーで）A：まっすぐ　行いって、それから　みぎへ　（　　　　）ください。B：はい、みぎですね。",
      options: ["まがって", "まって", "もらって", "あけて"],
      answer: "まがって",
    },
    {
      q: "きょうは　あついですから、エアコンを（　　　　）ましょう。",
      options: ["つけ", "あけ", "しめ", "とり"],
      answer: "つけ",
    },
    {
      q: "A：ワンさんは　どの　人ひとですか。B：あの　（　　　）が　たかい　人ひとですよ。",
      options: ["せ", "め", "あたま", "かみ"],
      answer: "せ",
    },
  ],
  "語彙・文脈規定（後半レベル[20〜27か]）": [
    {
      q: "ここは　（　　）で　はらう　ことが　できますか。",
      options: ["げんきん", "でんき", "めいし", "けんがく"],
      answer: "げんきん",
    },
    {
      q: "こしが　いたくて　この　にもつを　（　　）　ことが　　できません。",
      options: ["もちあげる", "さかだちする", "とびこむ", "もぐる"],
      answer: "もちあげる",
    },
    {
      q: "二日ふつかよいで　（　　）　です。",
      options: [
        "ちょうしが　わるい",
        "からだに　いい",
        "むりな　ちょうし",
        "ちょうしが　よわい",
      ],
      answer: "ちょうしが　わるい",
    },
    {
      q: "しょどうを　たくさん　れんしゅう　しています。　（　　）　上手じょうずに　なりません。",
      options: ["しかし", "だんだん", "もうすぐ", "それから"],
      answer: "しかし",
    },
    {
      q: "一月いちがつ　一日ついたちは　一年ねんの　（　　）の　日ひだ。",
      options: ["はじめ", "おわり", "はじめて", "おわる"],
      answer: "はじめ",
    },
    {
      q: "日本にほんへ　行いくから　ビザが　（　　）。",
      options: ["いる", "ある", "売うる", "する"],
      answer: "いる",
    },
    {
      q: "先生せんせいは　 わたしの　いけんが　（　　）と　言いいました。",
      options: ["やくに　たつ", "やくに　かつ", "よくに　たつ", "ゆくに　かつ"],
      answer: "やくに　たつ",
    },
    {
      q: "わたしの　国くにに　電車でんしゃが　ないから　（　　）　と　思おもう。",
      options: ["ふべんだ", "むだだ", "べんりだ", "にぎやかだ"],
      answer: "ふべんだ",
    },
    {
      q: "あの　（　　）を　かぶっている　男おとこの　子こは　わたしの　弟おとうとです。",
      options: ["ぼうし", "めがね", "てぶくろ", "うんどうぐつ"],
      answer: "ぼうし",
    },
    {
      q: "新あたらしい　じむしょが　ある　ビルの　（　　）は　これです。",
      options: ["じゅうしょ", "しゅじん", "しゅうまつ", "しゅっちょう"],
      answer: "じゅうしょ",
    },
    {
      q: "パソコンが　こしょうしたので　新あたらしい　パソコンに　（　　）。",
      options: ["かえました", "こえました", "きえました", "ふえました"],
      answer: "かえました",
    },
    {
      q: "この　こうさてんは　（　　）ですから　左ひだりへ　まがってください。",
      options: ["うせつきんし", "させつきんし", "かせつきんし", "しせつきんし"],
      answer: "うせつきんし",
    },
    {
      q: "この　かんじの　（　　）を　教おしえてください。",
      options: ["いみ", "うみ", "かみ", "しゅみ"],
      answer: "いみ",
    },
    {
      q: "らいねん、　（　　）に　帰かえることを　かんがえています。",
      options: ["いなか", "おしいれ", "こくさい", "こうばん"],
      answer: "いなか",
    },
    {
      q: "（　　）で　ビザが　もらえなかったら　りゅうがくする　ことが　できません。",
      options: ["たいしかん", "ぼくじょう", "ばいてん", "たいいくかん"],
      answer: "たいしかん",
    },
    {
      q: "ねむいとき、くるまを　（　　　　）しないで　ください。",
      options: ["うんてん", "かいてん", "けんがく", "よやく"],
      answer: "うんてん",
    },
    {
      q: "たくさん　ピアノを　れんしゅう　しましたが、　（　　　　）　上手(じょうず)に　なりません。",
      options: ["なかなか", "ときどき", "べつべつ", "まあまあ"],
      answer: "なかなか",
    },
    {
      q: "これから　ともだちが　うちに　来きますから、　へやを　（　　　　）　します。",
      options: ["そうじ", "せんたく", "しょくじ", "きゅうけい"],
      answer: "そうじ",
    },
    {
      q: "スマホが　こわれましたが、ジョンさんに（　　　　）もらいました。",
      options: ["なおして", "つかって", "とまって", "はいて"],
      answer: "なおして",
    },
    {
      q: "A：ジャンさんは　いつも　スカートを（　　　　）いますね。B：ええ、スカートが　すきですから。",
      options: ["はいて", "きて", "もって", "かぶって"],
      answer: "はいて",
    },
    {
      q: "この　アパートは　（　　　　）が　やすいですが、ちょっと　えきまで　とおいです。",
      options: ["やちん", "げんかん", "やね", "げんきん"],
      answer: "やちん",
    },
    {
      q: "この　みちは　くるまが　おおいですから、気きを　　（　　　　）くださいね。",
      options: ["つけて", "もって", "みて", "きいて"],
      answer: "つけて",
    },
    {
      q: "コンビニは　あの　（　　　　）を　わたって　30メートルぐらい　あるくと　あります。",
      options: ["こうさてん", "しんごう", "たてもの", "こうつう"],
      answer: "こうさてん",
    },
    {
      q: "木村きむらさんは　この　きかいの　つかいかたを （　　　　）して　くれました。",
      options: ["せつめい", "あんない", "しょうかい", "しゅうり"],
      answer: "せつめい",
    },
    {
      q: "あしたの　かいぎの　（　　　　）を　しなければ　なりません。",
      options: ["じゅんび", "しあい", "おみまい", "てんきん"],
      answer: "じゅんび",
    },
    {
      q: "ケニーさんは　　（　　　　）を　とっても、ずっと　きれいですね。",
      options: ["とし", "さい", "ねん", "かず"],
      answer: "とし",
    },
    {
      q: "もし　（　　　　）が　あったら、ほかの　しごとも　したいです。",
      options: ["チャンス", "グループ", "カード", "サイズ"],
      answer: "チャンス",
    },
    {
      q: "A：ジムさんは　どこで　髪かみ を　きっていますか。B：わたしは　（　　　　）きっています。かんたんですよ。",
      options: ["じぶんで", "ひとりで", "いちどで", "わたしで"],
      answer: "じぶんで",
    },
    {
      q: "A：どこに　くるまを　とめましょうか。B：あそこに（　　　　）が　ありますよ。A：じゃ、あそこに　とめますね。",
      options: [
        "ちゅうしゃじょう",
        "おうだんほどう",
        "こうさてん",
        "めんきょしょう",
      ],
      answer: "ちゅうしゃじょう",
    },
  ],
  "語彙・言い換え類義（中盤レベル[13〜19か]）": [
    {
      q: "金きんよう日びは　学校がっこうを　休やすみました。",
      options: [
        "金よう日は　学校へ　行いきませんでした。",
        "金日は　学校に　いました。",
        "金よう日は　学校へ　きました。",
        "金よう日は　学校から　かえりました。",
      ],
      answer: "金よう日は　学校へ　行いきませんでした。",
    },
    {
      q: "オーストラリアへ　こうくうびんで　にもつを　おくります。",
      options: [
        "オーストラリアへ　エアメールで　にもつを　おくります。",
        "オーストラリアへ　ふなびんで　にもつを　おくります。",
        "オーストラリアへ　イアメールで　にもつを　おくります。",
        "オーストラリアへ　ふねびんで　にもつを　おくります。",
      ],
      answer: "オーストラリアへ　エアメールで　にもつを　おくります。",
    },
    {
      q: "えきに　人が　おおかったです。",
      options: [
        "えきに　人が　たくさん　いました。",
        "えきに　人が　ときどき　いました。",
        "えきに　人が　ずっと　いました。",
        "えきに　人が　すこし　いました。",
      ],
      answer: "えきに　人が　たくさん　いました。",
    },
    {
      q: "今日きょうの　しけんは　むずかしく　なかったです。",
      options: [
        "今日の　しけんは　かんたんでした。",
        "今日の　しけんは　つかれました。",
        "今日の　しけんは　はやかったです。",
        "今日の　しけんは　おもかったです。",
      ],
      answer: "今日の　しけんは　かんたんでした。",
    },
    {
      q: "こんばん　つまと　レストランへ　しょくじに　行いきます。",
      options: [
        "こんばん　つまと　レストランへ　食たべに　行きます。",
        "こんばん　つまと　レストランへ　およぎに　行きます。",
        "こんばん　つまと　レストランへ　見に　行きます。",
        "こんばん　つまと　レストランへ　読よみに　行きます。",
      ],
      answer: "こんばん　つまと　レストランへ　食たべに　行きます。",
    },
    {
      q: "この　かいぎしつは　せまい　です。",
      options: [
        "この　かいぎしつは　大おおきくない　です。",
        "この　かいぎしつは　はやくない　です。",
        "この　かいぎしつは　ひろい　です。",
        "この　かいぎしつは　小ちいさくない　です。",
      ],
      answer: "この　かいぎしつは　大おおきくない　です。",
    },
    {
      q: "時間じかんが　ありませんから　いそいで　書かいて　ください。",
      options: [
        "時間が　ありませんから　はやく　書いて　ほしいです。",
        "時間が　ありませんから　ゆっくり　書いて　ください。",
        "時間が　ありませんから　きれいに　書いて　ください。",
        "時間が　ありませんから　後あとで　書いて　ほしいです。",
      ],
      answer: "時間が　ありませんから　はやく　書いて　ほしいです。",
    },
    {
      q: "おうふくの　きっぷを　かって　ください。",
      options: [
        "行いきと　帰かえりの　きっぷを　かって　ください。",
        "行きだけの　きっぷを　かって　ください。",
        "帰りの　きっぷを　かって　ください。",
        "かたみちの　きっぷを　かって　ください。",
      ],
      answer: "行いきと　帰かえりの　きっぷを　かって　ください。",
    },
    {
      q: "あねは　ずっと　どくしんです。",
      options: [
        "あねは　まだ　けっこんして　いません。",
        "あねは　ずっと　しっています。",
        "あねは　まだ　おなじ　ところに　すんでいます。",
        "あねは　ずっと　しりょうを　つくっています。",
      ],
      answer: "あねは　まだ　けっこんして　いません。",
    },
    {
      q: "この　かしゅを　しっていますか。",
      options: [
        "この　かしゅは　わかりますか。",
        "この　かしゅを　しりましょうか。",
        "この　かしゅに　あいましたか。",
        "この　かしゅが　すきですか。",
      ],
      answer: "この　かしゅは　わかりますか。",
    },
    {
      q: "この　えきで　つぎの　電車でんしゃに　のりかえます。",
      options: [
        "この　えきで　電車を　おりて　また　ちがう　でんしゃに　のります。",
        "この　えきで　電車を　おりて　うちへ　かえります。",
        "この　えきへ　入はいって　電車を　まちます。",
        "この　えきへ　行いって　電車の　きっぷを　買かいます。",
      ],
      answer:
        "この　えきで　電車を　おりて　また　ちがう　でんしゃに　のります。",
    },
    {
      q: "きんがくを　かくにんしてから　ひき出だします。",
      options: [
        "ざんだかしょうかいを　してから　ひき出します。",
        "ふりこみを　してから　ひき出します。",
        "ふりかえを　してから　ひき出します。",
        "あんしょうばんごう　かくにん　してから　ひき出します。",
      ],
      answer: "ざんだかしょうかいを　してから　ひき出します。",
    },
    {
      q: "この　レストランは　きんえんです。",
      options: [
        "この　レストランで　たばこを　すわないで　ください。",
        "この　レストランで　たばこを　すわなくても　いいです。",
        "この　レストランで　たばこを　すわなければ　なりません。",
        "この　レストランで　たばこを　すっても　いいです。",
      ],
      answer: "この　レストランで　たばこを　すわないで　ください。",
    },
    {
      q: "こんばん　おふろに　入はいらないで　ください。",
      options: [
        "こんばん　おふろに　入っては　いけません。",
        "こんばん　おふろに　入って　ください。",
        "こんばん　おふろに　入っても　いいです。",
        "こんばん　おふろに　入らなければ　なりません。",
      ],
      answer: "こんばん　おふろに　入っては　いけません。",
    },
    {
      q: "まいにち　8時じ から　10時じ まで　べんきょうしています。",
      options: [
        "まいにち　2時間じかん 　べんきょうしています。",
        "まいにち　2時じ 　べんきょうしています。",
        "まいにち　2週間しゅうかん 　べんきょうしています。",
        "まいにち　2週しゅう 　べんきょうしています。",
      ],
      answer: "まいにち　2時間じかん 　べんきょうしています。",
    },
    {
      q: "きょうの　てんきは　あまり　よくなかったです。",
      options: [
        "きょうは　あめでした。",
        "きょうは　はれでした。",
        "きょうは　あつかったです。",
        "きょうは　すずしかったです。",
      ],
      answer: "きょうは　あめでした。",
    },
    {
      q: "わたしは　いま　時間じかん が　ほしいです。",
      options: [
        "わたしは　いま　とても　いそがしいです。",
        "わたしは　いま　ぜんぜん　お金かねが　ありません。",
        "わたしは　いま　とても　さびしいです。",
        "わたしは　いま　とけいを　もって　いません。",
      ],
      answer: "わたしは　いま　とても　いそがしいです。",
    },
    {
      q: "いま　田中たなかさんの　しごとを　てつだって　います。",
      options: [
        "いま　田中たなかさんと　いっしょに　しごとを　しています。",
        "いま　田中たなかさんに　しごとを　おしえています。",
        "いま　田中たなかさんは　しごとを　していません。",
        "いま　田中たなかさんは　ときどき　しごとを　やすみます。",
      ],
      answer: "いま　田中たなかさんと　いっしょに　しごとを　しています。",
    },
    {
      q: "わたしの　せんもんは　けいざいです。",
      options: [
        "大学だいがくで　けいざいを　べんきょうして　います。",
        "一人ひとりで　けいざいを　べんきょうして　います。",
        "けいざいの　しごとを　したいです。",
        "けいざいの　けんきゅうを　したいです。",
      ],
      answer: "大学だいがくで　けいざいを　べんきょうして　います。",
    },
    {
      q: "この　かいしゃを　やめました。",
      options: [
        "いま　この　かいしゃで　はたらいて　いません。",
        "いま　この　かいしゃは　ありません。",
        "いま　この　かいしゃは　にんきが　あります。",
        "いま　この　かいしゃは　ちょうしが　わるいです。",
      ],
      answer: "いま　この　かいしゃで　はたらいて　いません。",
    },
    {
      q: "明日あしたは　しけんですから、えんぴつを　もってきて　ください。",
      options: [
        "明日あしたは　しけんですから、えんぴつを　わすれないで　ください。",
        "明日あしたは　しけんですから、えんぴつで　かいて　ください。",
        "明日あしたは　しけんですから、えんぴつを　つかわないで　ください。",
        "明日あしたは　しけんですから、えんぴつを　かいに　いって　ください。",
      ],
      answer:
        "明日あしたは　しけんですから、えんぴつを　わすれないで　ください。",
    },
  ],
  "語彙・言い換え類義（後半レベル[20〜27か]）": [
    {
      q: "わたしの　しゅみは　ピアノを　ひく　ことです。",
      options: [
        "わたしは　ピアノを　ひく　ことが　すきです。",
        "わたしの　しごとは　ピアノを　教おしえる　ことです。",
        "わたしは　ピアノを　ひく　ことが　へたです。",
        "わたしの　しゅじんは　ピアノを　ひく　ことが　できます。",
      ],
      answer: "わたしは　ピアノを　ひく　ことが　すきです。",
    },
    {
      q: "食たべる前まえに　手てを　あらわなければ　なりません。",
      options: [
        "手を　あらってから、食べる　ことが　できます。",
        "食べてから　手を　あらっても　いいです。",
        "食べてから　手を　あらう　ことが　できます。",
        "食べる前に　手を　あらわないで　ください。",
      ],
      answer: "手を　あらってから、食べる　ことが　できます。",
    },
    {
      q: "いちど　落語らくご を　れんしゅうした　ことが　あります。",
      options: [
        "いっかい　落語らくごを　れんしゅうしました。",
        "いっかい　落語らくごを　教おしえました。",
        "いちど　落語らくごを　聞きいた　ことが　あります。",
        "いちども　落語らくごを　見みた　ことが　ありません。",
      ],
      answer: "いっかい　落語らくごを　れんしゅうしました。",
    },
    {
      q: "今日きょう　せんたくを　しなければ　なりません。",
      options: [
        "今日　ふくを　あらわなければ　なりません。",
        "今日　むりを　しなければ　なりません。",
        "今日　そうじを　しなければ　なりません。",
        "今日　りょうりを　つくらなければ　なりません。",
      ],
      answer: "今日　ふくを　あらわなければ　なりません。",
    },
    {
      q: "じどうしゃの　ちょうしが　わるいから　しゅうりしている。",
      options: [
        "じどうしゃの　ちょうしが　わるいから　なおしている。",
        "じどうしゃの　ちょうしが　わるいから　しらべている。",
        "じどうしゃの　ちょうしが　わるいから　しんぱいしている。",
        "じどうしゃの　ちょうしが　わるいから　なくしている。",
      ],
      answer: "じどうしゃの　ちょうしが　わるいから　なおしている。",
    },
    {
      q: "やさいや　くだものの　ぶっかが　高たかく　なっている。",
      options: [
        "やさいや　くだものの　金きんがくが　高く　なっている。",
        "やさいや　くだものの　おつりが　高く　なっている。",
        "やさいや　くだものが　大おおきく　なっている。",
        "やさいや　くだものが　よく　なっている。",
      ],
      answer: "やさいや　くだものの　金きんがくが　高く　なっている。",
    },
    {
      q: "先週せんしゅうの　しあいに　かつ　ことが　できませんでした。",
      options: [
        "先週の　しあいに　まけました。",
        "先週の　しあいを　休やすみました。",
        "先週の　しあいに　まける　ことが　できませんでした。",
        "先週の　しあいに　出る　ことが　できませんでした。",
      ],
      answer: "先週の　しあいに　まけました。",
    },
    {
      q: "しゅしょうと　大だいとうりょうは　同おなじでは　ない。",
      options: [
        "しゅしょうと　大とうりょうは　ちがう。",
        "しゅしょうと　大とうりょうは　すごい。",
        "しゅしょうと　大とうりょうは　たりる。",
        "しゅしょうと　大とうりょうは　しかたが　ない。",
      ],
      answer: "しゅしょうと　大とうりょうは　ちがう。",
    },
    {
      q: "今月こんげつの　アパートの　やちんは　まだ　はらっていません。",
      options: [
        "今月の　アパートの　お金かねは　まだ　はらっていません。",
        "今月の　アパートの　水みずは　まだ　はらっていません。",
        "今月の　アパートの　電気でんきは　まだ　はらっていません。",
        "今月の　アパートの　やくそくは　まだ　はらっていません。",
      ],
      answer: "今月の　アパートの　お金かねは　まだ　はらっていません。",
    },
    {
      q: "ここは　わたしの　うちの　ダイニングキッチン　です。",
      options: [
        "ここは　わたしの　うちの　だいどころ　と　しょくどう　です。",
        "ここは　わたしの　うちの　居間いま と　しんしつ　です。",
        "ここは　わたしの　うちの　げんかんと　ふろ場ば　です。",
        "ここは　わたしの　うちの　せんめん所じょと　ろうか　です。",
      ],
      answer: "ここは　わたしの　うちの　だいどころ　と　しょくどう　です。",
    },
    {
      q: "ここは　たてものの　入口いりぐちですから　ちゅうしゃきんし　です。",
      options: [
        "ここは　たてものの　入口いりぐちですから　車くるまを　とめないでください。",
        "ここは　たてものの　入口いりぐちですから　ちゅうしゃじょうが　あります。",
        "ここは　たてものの　入口いりぐちですから　ちゅうしゃしても　いいです。",
        "ここは　たてものの　入口いりぐちですから　電車でんしゃが　来きます。",
      ],
      answer:
        "ここは　たてものの　入口いりぐちですから　車くるまを　とめないでください。",
    },
    {
      q: "この　カラオケの　きかいが　動うごきません。",
      options: [
        "この　カラオケの　きかいが　こしょうしています。",
        "この　カラオケの　きかいが　こうつうしています。",
        "この　カラオケの　きかいが　ふべんです。",
        "この　カラオケの　きかいを　しゅうり　しなければなりません。",
      ],
      answer: "この　カラオケの　きかいが　こしょうしています。",
    },
    {
      q: "明日あしたは　こうじょうを　けんがくに　行いきます。",
      options: [
        "明日あしたは　こうじょうを　見みに　行いきます。",
        "明日あしたは　こうじょうで　はたらきます。",
        "明日あしたは　こうじょうを　よやくしに　行いきます。",
        "明日あしたは　こうじょうへ　あそびに　行いきます。",
      ],
      answer: "明日あしたは　こうじょうを　見みに　行いきます。",
    },
    {
      q: "一人ひとりで　この　しごとは　むりです。",
      options: [
        "一人ひとりで　この　しごとは　できません。",
        "一人ひとりで　この　しごとは　むりです。",
        "一人ひとりで　この　しごとは　かんたんです。",
        "一人ひとりで　この　しごとは　だいじです。",
      ],
      answer: "一人ひとりで　この　しごとは　できません。",
    },
    {
      q: "この間あいだ、キムさんに　会あいました。",
      options: [
        "少すこし前まえ 、キムさんに　会あいました。",
        "一日前いちにちまえ 、キムさんに　会あいました。",
        "一年前いちねんまえ、キムさんに　会あいました。",
        "かなり前まえ 、キムさんに　会あいました。",
      ],
      answer: "少すこし前まえ 、キムさんに　会あいました。",
    },
    {
      q: "みんなの前まえで　スピーチを　しました。",
      options: [
        "みんなの前まえで　話はなしました。",
        "みんなの前まえで　うたいました。",
        "みんなの前まえで　いけんを　言いいました。",
        "みんなの前まえで　話はなし を　聞ききました。",
      ],
      answer: "みんなの前まえで　話はなしました。",
    },
    {
      q: "うちの　犬いぬに　赤あかちゃんが　うまれました。",
      options: [
        "うちの　犬いぬに　子こどもが　できました。",
        "うちの　犬いぬが　びょうきに　なりました。",
        "うちの　犬いぬの　子こどもを　あげました。",
        "うちの　犬いぬの　名前なまえを　きめました。",
      ],
      answer: "うちの　犬いぬに　子こどもが　できました。",
    },
    {
      q: "来月らいげつ、東京とうきょうに　ひっこしします。",
      options: [
        "来月らいげつ、東京とうきょうの　新あたらしい　家いえに　行いきます。",
        "来月らいげつ、東京とうきょうの　新あたらしい　会社かいしゃで　はたらきます。",
        "来月らいげつ、東京とうきょうの　学校がっこうで　勉強べんきょうします。",
        "来月らいげつ、東京とうきょうの　街まちを　旅行りょこうします。",
      ],
      answer:
        "来月らいげつ、東京とうきょうの　新あたらしい　家いえに　行いきます。",
    },
    {
      q: "パーティーに　友ともだちを　つれてきても　いいですか。",
      options: [
        "パーティーに　友ともだちと　いっしょに　行いっても　いいですか。",
        "パーティーを　友ともだちに　教おしえても　いいですか。",
        "パーティーに　友ともだちが　行いけなくても　いいですか。",
        "パーティーを　友ともだちに　しょうかいしても　いいですか。",
      ],
      answer:
        "パーティーに　友ともだちと　いっしょに　行いっても　いいですか。",
    },
    {
      q: "日本にほんは　ろうじんが　とても　多おおい　国くにです。",
      options: [
        "日本にほんには　おとしよりが　たくさん　います。",
        "日本にほんには　外国人がいこくじんが　たくさん　います。",
        "日本にほんには　大おおきい　会社かいしゃが　たくさん　あります。",
        "日本にほんには　いろいろな　店みせが　あります。",
      ],
      answer: "日本にほんには　おとしよりが　たくさん　います。",
    },
  ],
  "文法・文の文法1（前半レベル[3〜9か]）": [
    {
      q: "きのうkinou１０じにjini（　　　　　　）。",
      options: [
        "ねましたnemashita",
        "ねますnemasu",
        "ねませんnemasen",
        "ねますたnemasuta",
      ],
      answer: "ねましたnemashita",
    },
    {
      q: "としょかん のtoshokan no（　　　　　　　）はwa06-1122-2255です。desu",
      options: [
        "でんわばんごうdenwabangou",
        "でんわばんごdenwabango",
        "でんばんごうdenbangou",
        "でんわなんばんdenwananban",
      ],
      answer: "でんわばんごうdenwabangou",
    },
    {
      q: "A：いとうさんはitousanwa　けさkesa（　　　　　　　）。B：はい、hai　べんきょうしました。benkyoushimashita",
      options: [
        "べんきょうしましたかbenkyoushimashitaka",
        "べんきょうですかbenkyoudesuka",
        "べんきょうしますかbenkyoushimasuka",
        "べんきょうしませんかbenkyoushimasenka",
      ],
      answer: "べんきょうしましたかbenkyoushimashitaka",
    },
    {
      q: "A：モニカさんはmonikasanwa　きのうのばんkinounoban　はたらきましたか。hatarakimashitakaB：いいえ、iie（　　　　　　）。",
      options: [
        "はたらきませんでしたhatarakimasendeshita",
        "はたらきませんhatarakimasendesen",
        "はたらきましたhatarakimashita",
        "はたらきますhatarakimasu",
      ],
      answer: "はたらきませんでしたhatarakimasendeshita",
    },
    {
      q: "A：キムさんのkimusannoでんわばんごうはdenwabangouwaなんばんnanban　ですか。desukaB：（　　　　　　）でんわばんごうはdenwabangouwa090-7631-9011です。desu",
      options: [
        "わたしのwatashino",
        "わたしwatashi",
        "わたしとwatashito",
        "わたしはwatashiwa",
      ],
      answer: "わたしのwatashino",
    },
    {
      q: "かいしゃのkaishanoでんわばんごう はdenwabangouwa（　　　　）ですか。desuka",
      options: [
        "なんばんnanban",
        "なんばんごうnanbangou",
        "なんぼんnanbon",
        "なんぷんnanpun",
      ],
      answer: "なんばんnanban",
    },
    {
      q: "おとといototoi（　　　　　　）。",
      options: [
        "べんきょうしませんでしたbenkyoushimasendeshita",
        "べんきょうしませんbenkyoushimasen",
        "べんきょうじゃありませんbenkyoujaarimasen",
        "べんきょうじゃありませんでしたbenkyoujaarimasendeshita",
      ],
      answer: "べんきょうしませんでしたbenkyoushimasendeshita",
    },
    {
      q: "（　　　　）７じにjiniおきました。okimashita",
      options: [
        "けさkesa",
        "あしたashita",
        "まいにちmainichi",
        "あさってasatte",
      ],
      answer: "けさkesa",
    },
    {
      q: "わたしはwatashiwaきょうkyou（　　　　）。やすみます。yasumimasu",
      options: [
        "はたらきませんhatarakimasen",
        "はたらきましんhatarakimashin",
        "はたらきましたhatarakimasshita",
        "はたらきますhatarakimasu",
      ],
      answer: "はたらきませんhatarakimasen",
    },
    {
      q: "A：たなかさんはtanakasanwa　きのうkinou（　　　　　）か。kaB：はい、hai　はたらきました。hatarakimashita",
      options: [
        "はたらきましたhatarakimashita",
        "はたらきますhatarakimasu",
        "はたらきませんhatarakimasen",
        "はたらくhataraku",
      ],
      answer: "はたらきましたhatarakimashita",
    },
    {
      q: "A：リンさんはrinsanwa　なんようびにnanyoubini　やすみますか。yasumimasukaB：どようびとdoyoubito　にちようびにnichiyoubini（　　　　　）。",
      options: [
        "やすみますyasumimasu",
        "やすみですyasumidesu",
        "やすむますyasumumasu",
        "やすますyasumasu",
      ],
      answer: "やすみますyasumimasu",
    },
    {
      q: "A：たなかさんはtanakasanwa（　　　　　　）なんじにnanjiniおきますか。okimasukaB：７じjiはんhanにni　おきます。okimasu",
      options: [
        "まいあさmaiasa",
        "まいあさにmaiasani",
        "きのうkinou",
        "こんばんにkonbanni",
      ],
      answer: "まいあさmaiasa",
    },
    {
      q: "A：すみません、sumimasen（　　　　）やすみますか。yasumimasukaB：６じjiからkara　やすみます。yasumimasu",
      options: [
        "なんじnanjiからkara",
        "なんようびnanyoubiからkara",
        "なんじnanji",
        "なんじnanjiとto",
      ],
      answer: "なんじnanjiからkara",
    },
    {
      q: "わたしはwatashiwa（　　　　　　）にniやすみます。yasumimasu",
      options: [
        "すいようびsuiyoubi",
        "ばんban",
        "あしたashita",
        "まいばんmaiban",
      ],
      answer: "すいようびsuiyoubi",
    },
    {
      q: "（　　　　）べんきょうします。benkyoushimasu",
      options: ["あさasa", "あさにasani", "あさのasano", "あさはasawa"],
      answer: "あさasa",
    },
    {
      q: "げつようびgetsuyoubiからkara（　　　　　）までmadeはたらきます。hatarakimasu",
      options: [
        "きんようびkinyoubi",
        "おとといototoi",
        "ひるやすみhiruyasumi",
        "まいにちmainichi",
      ],
      answer: "きんようびkinyoubi",
    },
    {
      q: "A：キムさんはkimusanwa　なんじにnanjini　おきますか。okimasukaB：わたしはwatashiwa（　　　　　　　　）。",
      options: [
        "７じにjini　おきます。okimasu",
        "７じからjikara　おきます。okimasu",
        "７じにjini　ねます。okimasu",
        "７じji　ねます。okimasu",
      ],
      answer: "７じにjini　おきます。okimasu",
    },
    {
      q: "わたしはwatashiwa１１じji（　　　　）ねます。nemasu",
      options: ["にni", "のno", "でde", "ねne"],
      answer: "にni",
    },
    {
      q: "すずきさん はsuzukisanwa２じjiからkara（　　　　　　）。",
      options: [
        "やすみますyasumimasu",
        "やすみyasumiですdesu",
        "やすむますyasumumasu",
        "やすむyasumuですdesu",
      ],
      answer: "やすみますyasumimasu",
    },
    {
      q: "わたしはwatashiwa　１０じjiからkara１２じjiまでmade（　　　　　　）。",
      options: [
        "べんきょうbenkyouしますshimasu",
        "しますshimasu",
        "べんきょうbenkyouですdesu",
        "べんきょうbenkyouますmasu",
      ],
      answer: "べんきょうbenkyouしますshimasu",
    },
    {
      q: "４：２５",
      options: [
        "よじyoji　にじゅうごふんnihuugohun",
        "よんじyonji　にじゅうごふんnihuugohun",
        "よじyoji　じゅうにふんjuunihun",
        "しちじshichiji　にじゅうごふんnihuugohun",
      ],
      answer: "よじyoji　にじゅうごふんnihuugohun",
    },
    {
      q: "きょうはkyouwa　かようびkayoubiです。desu（　　　　　）はwaすいようびsuiyoubiです。desu",
      options: [
        "あしたashita",
        "きのうkinou",
        "おとといototoi",
        "あさってasatte",
      ],
      answer: "あしたashita",
    },
    {
      q: "やすみはyasumiwa　げつようびgetsuyoubi（　　）きんようびkinyoubiです。desu",
      options: ["とto", "のno", "をo", "はwa"],
      answer: "とto",
    },
    {
      q: "A：やすみはyasumiwa（　　　　　）ですか。desuka B：にちようびnichiyoubiです。desu",
      options: [
        "なんようびnanyoubi",
        "なんじnanji",
        "なんがいnangai",
        "なんよびnanyobi",
      ],
      answer: "なんようびnanyoubi",
    },
    {
      q: "A：としょかんはtoshokanwa　なんじnanjiからkaraですか。desukaB：（　　　　　　　）です。desu",
      options: [
        "１０じjiからkaraです。desu",
        "１０じjiまでmadeです。desu",
        "１０じjiです。desu",
        "１０じjiにniです。desu",
      ],
      answer: "１０じjiからkaraです。desu",
    },
    {
      q: "ぎんこうはginkouwa９じji（　　　　）５じjiまでmadeです。desu",
      options: ["からkara", "だれdare", "これkore", "たらtara"],
      answer: "からkara",
    },
    {
      q: "PM 7:15",
      options: [
        "ごごgogo　しちじshichijiじゅうごふんjuugohun",
        "ごごgogo　いちじichiji　じゅうごっぷんjuugoppun",
        "ごごgogo　しちじshichiji　ごじゅっぷんgojuppun",
        "ごごgogo　はちじhachichiji　じゅうごふんjuugohun",
      ],
      answer: "ごごgogo　しちじshichijiじゅうごふんjuugohun",
    },
    {
      q: "AM 11:30",
      options: [
        "ごぜんgozen　じゅういちじjuuichiji　はんhan",
        "ごごgogoじゅういちじjuuichijiはんhan",
        "ごぜんgozenじゅういちじjuuichijiばんban",
        "ごごgogoじゅういちじjuuichijiばんban",
      ],
      answer: "ごぜんgozen　じゅういちじjuuichiji　はんhan",
    },
    {
      q: "いまima５（　　）２０ぷんpunです。desu",
      options: ["じji", "ぢji", "ぎgi", "びbi"],
      answer: "じji",
    },
    {
      q: "A：いまima（　　）ですか。desukaB：９じjiです。desu",
      options: ["なんじnanji", "なんぷんnanpun", "いつitsu", "なんnan"],
      answer: "なんじnanji",
    },
    {
      q: "246,000 えんen",
      options: [
        "にじゅうnijuuよんまんyonmanろくせんrokusenえんen",
        "にひゃくnihyakuよんじゅうyonjuuろくせんrokusenえんen",
        "にひゃくnihyakuよんまんyonmanろくせんrokusenえんen",
        "にじゅうnijuuよまんyomanろくせんrokusenえんen",
      ],
      answer: "にじゅうnijuuよんまんyonmanろくせんrokusenえんen",
    },
    {
      q: "58,000 えんen",
      options: [
        "ごまんgomanはっせんhassenえんen",
        "ごじゅうgjuuはっせんhassenえんen",
        "ごじゅうgojuuはちまんhachimanえんen",
        "ごうまんgoumanはっせんhassenえんen",
      ],
      answer: "ごまんgomanはっせんhassenえんen",
    },
    {
      q: "2,980 えんen",
      options: [
        "にせんnisenきゅうひゃくkyuuhyakuはちじゅうhachijuuえんen",
        "にぜんnisenきゅうひゃくkyuuhyakuはちじゅうhachijuuえんen",
        "にぜんnisenくひゃくkyuuhyakuはちじゅうhachijuuえんen",
        "にっせんnisenきゅうひゃくkyuuhyakuはちじゅうhachijuuえんen",
      ],
      answer: "にせんnisenきゅうひゃくkyuuhyakuはちじゅうhachijuuえんen",
    },
    {
      q: "350 えんen",
      options: [
        "さんびゃくsanbyakuごじゅうgojuuえんen",
        "さんひゃくsanbyakuごじゅうgojuuえんen",
        "さんびゃくsanbyakuごっじゅうgojuuえんen",
        "さんびゃくsanbyakuごじゅgojuuえんen",
      ],
      answer: "さんびゃくsanbyakuごじゅうgojuuえんen",
    },
    {
      q: "A：そのsonoくつはkutsuwa（　　　　　）ですか。desukaB：2000えんenです。desu",
      options: ["いくらikura", "なんさいnansai", "だれdare", "どちらdochira"],
      answer: "いくらikura",
    },
    {
      q: "A：あれは　arewaなんの　nannoざっしzasshiですか。desuka B：（　　　　　）のno　ざっしzasshiです。desu",
      options: [
        "じどうしゃjidousha",
        "わたしwatashi",
        "ほんhon",
        "かいぎしつkaigishitsu",
      ],
      answer: "じどうしゃjidousha",
    },
    {
      q: "A：これはkorewaだれのdarenoほんhonですか。desuka B：（　　　　　）のnoです。desu",
      options: [
        "さとうさんsatousan",
        "イタリアitaria",
        "にほんごnihongo",
        "あそこasoko",
      ],
      answer: "さとうさんsatousan",
    },
    {
      q: "すみませんsumimasen、そのsonoネクタイをnekutaio（　　　　　　）。",
      options: [
        "みせてくださいmisetekudasai",
        "みてくださいmitekudasai",
        "みさてくださいmisatekudasai",
        "みるてくださいmirutekudasai",
      ],
      answer: "みせてくださいmisetekudasai",
    },
    {
      q: "A：それはsorewa（　　　　　）とけいtokeiですか。desukaB：にほんのnihonnoです。desu",
      options: ["どこのdokono", "どこdoko", "だれのdareno", "ここのkokono"],
      answer: "どこのdokono",
    },
    {
      q: "これはkorewaちゅうごくchuugoku（　　）でんわdenwaです。desu",
      options: ["のno", "はwa", "とto", "でde"],
      answer: "のno",
    },
    {
      q: "わたしのwatashino（　　　　　）はwaフィリピンfiripinです。desu",
      options: ["くにkuni", "おくにokuni", "じんjin", "ここkoko"],
      answer: "くにkuni",
    },
    {
      q: "A：（　　　　　）はwaどこdokoですか。desukaB：アメリカamerikaです。desu",
      options: [
        "おくにokuni",
        "でんわdenwa",
        "おなまえonamae",
        "そちらsochira",
      ],
      answer: "おくにokuni",
    },
    {
      q: "しょくどうはshokudouwa（　　　　）１かいkaiです。desu",
      options: ["ちかchika", "さかsaka", "ちりchiri", "さきsaki"],
      answer: "ちかchika",
    },
    {
      q: "ロビーはrobiiwa（　　　　）です。desu",
      options: [
        "そちらsochira",
        "かちらkachira",
        "うちらuchira",
        "どちらdochira",
      ],
      answer: "そちらsochira",
    },
    {
      q: "A：（　　　　　）はwaあそこasokoですか。desukaB：はい、haiトイレ はtoirewaあそこasokoです。desu",
      options: [
        "おてあらいotearai",
        "かいしゃkaisha",
        "うちuchi",
        "かいだんkaidan",
      ],
      answer: "おてあらいotearai",
    },
    {
      q: "A：エレベーターはerebeetaawa（　　　　）ですか。desukaB：あそこasokoです。desu",
      options: ["どこdoko", "だれdare", "なんnan", "なにkokowa"],
      answer: "どこdoko",
    },
    {
      q: "そこはsokowaかいぎしつkaigishitsu（　　　　）。",
      options: [
        "でございますdegozaimasu",
        "ございますgozaimasu",
        "おねがいしますonegaishimasu",
        "ございましたgozaimashita",
      ],
      answer: "でございますdegozaimasu",
    },
    {
      q: "ワインうりば はwainuribawa２（　　　　）です。desu",
      options: ["かいkai", "まいmai", "さいsai", "かんkan"],
      answer: "かいkai",
    },
    {
      q: "（　　　　）はwaうけつけuketsukeです。desu",
      options: ["あそこasoko", "あなたanata", "あこako", "あたらatara"],
      answer: "あそこasoko",
    },
    {
      q: "ここはkokowa（　　）です。desu",
      options: ["トイレtoire", "とけいtokei", "カードkaado", "じしょjisho"],
      answer: "トイレtoire",
    },
    {
      q: "A：どうぞdouzoよろしくyoroshikuおねがいします。onegaishimasu B：（　　　　　　）よろしく。yoroshiku",
      options: [
        "こちらこそkochirakoso",
        "これこそkorekoso",
        "そちらこそsochirakoso",
        "あちらこそachirakoso",
      ],
      answer: "こちらこそkochirakoso",
    },
    {
      q: "A：（　　　　　）それはsorewaなんnanですか。desuka B：これはkorewaてちょうtechouです。desu",
      options: ["あのうanou", "あうんaun", "どうもdoumo", "あれare"],
      answer: "あのうanou",
    },
    {
      q: "A：そのsonoしんぶんはshinbunwaにほんのnihonnoしんぶんshinbunですか。desuka B：いいえ、iie（　　 　　　　）しんぶんshinbunです。desu",
      options: [
        "かんこくのkankokuno",
        "わたしのwatashino",
        "ざっしのzasshino",
        "やまださんのyamadasanno",
      ],
      answer: "かんこくのkankokuno",
    },
    {
      q: "A：コーヒーです。koohiidesu（　　　　　）。 B：どうも。doumo",
      options: ["どうぞdouzo", "そうですsoudesu", "あのうanou", "いいえiie"],
      answer: "どうぞdouzo",
    },
    {
      q: "A：これはkorewa（　　　　　）ボールペンboorupenですか。desuka B：あ、aそれはsorewaわたしのwatashinoです。desu",
      options: ["だれのdareno", "このkono", "だれdare", "なんのnanno"],
      answer: "だれのdareno",
    },
    {
      q: "A：そのsonoかさはkasawaモニカさんのmonikasannoですか。desuka B：いいえ、iie（　　 　　　　）。ハリィさんのhariisannoです。desu",
      options: [
        "ちがいますchigaimasu",
        "そうですsoudesu",
        "そうですかsoudesuka",
        "だめですdamedesu",
      ],
      answer: "ちがいますchigaimasu",
    },
    {
      q: "A：このkonoざっしはzasshiwaさとうさんのsatousannoですか。desuka B：いいえ、iie（　　　　）ざっしはzasshiwaやまださんのyamadasannoです。desu",
      options: ["そのsono", "このkono", "あのano", "それのsoreno"],
      answer: "そのsono",
    },
    {
      q: "A：このkonoめいしはmeishiwaだれのdarenoですか。desuka B：そのsonoめいしはmeishiwa（　　　　）です。desu",
      options: [
        "リンさんのrinsanno",
        "にほんごのnihongono",
        "えいごのeigono",
        "リンさんrinsan",
      ],
      answer: "リンさんのrinsanno",
    },
    {
      q: "A：そのsonoコンピューターはkonpyuutaawa（　　　　　　）ですか。desuka B：これはkorewaキムさんのkimusannoです。desu",
      options: ["だれのdareno", "なんのnanno", "だれdare", "なんnan"],
      answer: "だれのdareno",
    },
    {
      q: "（　　　　）えんぴつはenpitsuwaわたしのwatashino です。desu",
      options: ["このkono", "これkore", "それkore", "こんのkonno"],
      answer: "このkono",
    },
    {
      q: "たなかさんはtanakasan wa（　　　　　）けんきゅうしゃkenkyuusha です。desu",
      options: [
        "だいがくのdaigakuno",
        "どなたのdonatano",
        "えんぴつのenpitsuno",
        "しんぶんのshinbunno",
      ],
      answer: "だいがくのdaigakuno",
    },
    {
      q: "これはkorewaじどうしゃのjidoushano（　　　　　） です。desu",
      options: ["かぎkagi", "わたしwatashi", "それsore", "コーヒーkoohii"],
      answer: "かぎkagi",
    },
    {
      q: "わたしはwatashiwa（　　　　　　）きょうしkyoushi 　です。desu",
      options: [
        "にほんごのnihongono",
        "めいしのmeishino",
        "ざっしのzasshino",
        "でんきのdenkino",
      ],
      answer: "にほんごのnihongono",
    },
    {
      q: "これはkorewaにほんごのnihongono（　　　　　） です。desu",
      options: ["じしょjisho", "かさkasa", "つくえtsukue", "しゃいんshain"],
      answer: "じしょjisho",
    },
    {
      q: "A：それはsorewaにほんのnihonno じどうしゃjidousha　ですか。desuka B：いいえ、iieこれはkorewa（　　　　　）じどうしゃjidousha　です。desu",
      options: [
        "ドイツのdoitsuno",
        "ドイツじんdoitsujin",
        "ドイツdoitsu",
        "ドイツはdoitsuwa",
      ],
      answer: "ドイツのdoitsuno",
    },
    {
      q: "A：（　　　　　）カメラkamera 　ですか。desuka B：いいえ、iie　これはkorewa　カメラkameraじゃありません。jaarimasenラジオrajio です。desu",
      options: ["それはsorewa", "これはkorewa", "あれはarewa", "そのsono"],
      answer: "それはsorewa",
    },
    {
      q: "A：あれはarewaなんnanですか。desuka B：あれはarewa（　　　　　　） です。desu",
      options: [
        "コンピューターkonpyuutaa",
        "たなかさんtanakasan",
        "かいしゃいんkaishain",
        "どなたdonata",
      ],
      answer: "コンピューターkonpyuutaa",
    },
    {
      q: "A：それはsorewa（　　　　　）ですか。desuka B：これはkorewaカードkaado です。desu",
      options: ["なんnan", "だれdare", "どこdoko", "ないnai"],
      answer: "なんnan",
    },
    {
      q: "A：（　　　　　）とけいtokei 　ですか。desuka B：はい、hai　あれはarewa　とけいtokei 　です。desu",
      options: ["あれare", "おれore", "それsore", "これkore"],
      answer: "あれare",
    },
    {
      q: "A：それはsorewaえんぴつenpitsu ですか。desuka B：いいえ、iie（　　　　）はwa　シャープペンシルshaapupenshiruです。desu",
      options: ["これkore", "それsore", "あれare", "かれkare"],
      answer: "これkore",
    },
    {
      q: "わたしwatashi（　　）たなかtanakaです。desu",
      options: ["はwa", "わwa", "がga", "をo"],
      answer: "はwa",
    },
    {
      q: "わたしはwatashiwa（　　　　）です。desu",
      options: [
        "キムkimu",
        "あなたanata",
        "アメリカamerika",
        "みなさんminasan",
      ],
      answer: "キムkimu",
    },
    {
      q: "わたしはwatashiwa（　　　　）じんjinです。desu",
      options: ["にほんnihon", "きょうしkyoushi", "25", "しゃいんshain"],
      answer: "にほんnihon",
    },
    {
      q: "わたしはwatashiwa（　　　　）さいsaiです。desu",
      options: ["22", "ベトナムbetonamu", "いしゃisha", "キムkimu"],
      answer: "22",
    },
    {
      q: "わたしはwatashiwa（　　　　）です。desu",
      options: [
        "じっしゅうせいjisshuusei",
        "フィリピンfiripin",
        "ちゅうごくchuugoku",
        "だいがくdaigaku",
      ],
      answer: "じっしゅうせいjisshuusei",
    },
    {
      q: "どうぞdouzo（　　　　　　）おねがいします。onegaishimasu",
      options: [
        "よろしくyoroshiku",
        "よろしこyoroshiko",
        "よらしくyorashiku",
        "よろしきyoroshiki",
      ],
      answer: "よろしくyoroshiku",
    },
    {
      q: "31さいsai",
      options: [
        "さんじゅういっさいsanjuu issai",
        "さんじゅういちさいsanjuu ichisai",
        "さんじゅういさいsanjuu isai",
        "さんじゅっさいsanjussai",
      ],
      answer: "さんじゅういっさいsanjuu issai",
    },
    {
      q: "28さいsai",
      options: [
        "にじゅうはっさいnijuu hassai",
        "にじゅうはいさいnijuu haisai",
        "にじゅうやっさいnijuu yassai",
        "にじゅうはんさいnijuu hansai",
      ],
      answer: "にじゅうはっさいnijuu hassai",
    },
    {
      q: "50さいsai",
      options: [
        "ごじゅっさいgojussai",
        "ごじゅうさいgojuusai",
        "ごじゅんさいgojunsai",
        "ごじいさいgojiisai",
      ],
      answer: "ごじゅっさいgojussai",
    },
    {
      q: "（　　　　　　）。わたしはwatashiwaさとうsatouです。desu",
      options: [
        "はじめましてhajimemashite",
        "はじめてhajimete",
        "はじめましょうhajimemashou",
        "はじめましたhajimemashita",
      ],
      answer: "はじめましてhajimemashite",
    },
    {
      q: "A：しつれいですが、shitsureidesuga（　　　　　　　） B：わたしはwatashiwaハリィhariiです。desu",
      options: [
        "おなまえはonamaewa？",
        "おいくつonikutsuですかdesuka？",
        "なんさいnansaiですかdesuka？",
        "はじめましてhajimemashite。",
      ],
      answer: "おなまえはonamaewa？",
    },
    {
      q: "A：しつれいですが、shitsureidesuga（　　　　　　　）。 B：わたしはwatashiwa27さいsaiです。desu",
      options: [
        "おいくつoikutsuですかdesuka",
        "おなまえはonamaewa？",
        "どなたdonataですかdesuka",
        "ちゅうごくじんchuugokujinですかdesuka",
      ],
      answer: "おいくつoikutsuですかdesuka",
    },
    {
      q: "（　　　　　）はwaモンゴルじんmongorujinですか。desuka",
      options: [
        "ホランさんhoransan",
        "ホランhoran",
        "あなたanata",
        "どなたdonata",
      ],
      answer: "ホランさんhoransan",
    },
    {
      q: "A：ジョンさんjonsanはwaアメリカじんamerikajinですか。desuka B：はい、hai（　　　　　　　　）。",
      options: [
        "アメリカじんamerikajinです。desu",
        "アメリカじんamerikajinじゃありません。jaarimasen",
        "アメリカじんamerikajinですか。desuka",
        "アメリカじんamerikajinでした。desshita",
      ],
      answer: "アメリカじんamerikajinです。desu",
    },
    {
      q: "A：すずきさんsuzukisanはwaいしゃishaですか。desuka B：いいえ、iieいしゃisha（　　　　　　　　）。きょうしkyoushiですdesu。",
      options: [
        "じゃありませんjaarimasen",
        "じありませんjiarimasen",
        "じゃりませんjarimasen",
        "じゅりませんjurimasen",
      ],
      answer: "じゃありませんjaarimasen",
    },
    {
      q: "A：わたしはwatashiwaかいしゃいんkaishainです。desu B：わたしwatashi（　　　）かいしゃいんkaishainです。desu",
      options: ["もmo", "のno", "わwa", "はwa"],
      answer: "もmo",
    },
    {
      q: "（　　　　　　）、おいくつoikutsuですか。desuka",
      options: [
        "しつれいshitsureiですがdesuga",
        "しつらいshitsuraiですがdesuga",
        "しつれんshitsurenですがdesuga",
        "しつれきshitsurekiですがdesuga",
      ],
      answer: "しつれいshitsureiですがdesuga",
    },
    {
      q: "A：リンさんrinsanはwaじっしゅうせいjisshuuseiですdesu（　　）。 B：はい、haiじっしゅうせいjisshuuseiです。desu",
      options: ["かka", "もmo", "はwa", "よyo"],
      answer: "かka",
    },
    {
      q: "A：ムハマドさんmuhamadosanはwa（　　　　　）ですか。desuka B：いいえ、iieタイじんtaijinじゃありません。jaarimasenインドネシアじんindoneshiajinです。desu",
      options: [
        "タイじんtaijin",
        "インドネシアじんindoneshia jin",
        "インドネシアindoneshia",
        "タイtai",
      ],
      answer: "タイじんtaijin",
    },
    {
      q: "A：カレンさんkarensanはwaがくせいgakuseiですか。desuka B：いいえ、iieがくせいgakuseiじゃありません。jaarimasen（　　　　　）です。desu",
      options: [
        "けんきゅうしゃkenkyuusha",
        "おいくつoikutsu",
        "ドイツじんdoitsujin",
        "29さいsai",
      ],
      answer: "けんきゅうしゃkenkyuusha",
    },
    {
      q: "A：さとうさんの たんじょうびは（　　）ですか。B：わたしの　たんじょうびは １２月９日です。",
      options: ["いつ", "なに", "どこ", "いま"],
      answer: "いつ",
    },
    {
      q: "５月１４日",
      options: [
        "ごがつ　じゅうよっか",
        "ごがつ　じゅうよんにち",
        "ごがつ　じゅうしにち",
        "ごがつ　じゅうようか",
      ],
      answer: "ごがつ　じゅうよっか",
    },
    {
      q: "たなかさんは　（　　　　）ベトナムへ いきました。",
      options: ["きょねん", "らいねん", "らいげつ", "らいしゅう"],
      answer: "きょねん",
    },
    {
      q: "８月３日",
      options: [
        "はちがつ　みっか",
        "さんがつ　ようか",
        "はちがつ　さんにち",
        "さんがつ　よっか",
      ],
      answer: "はちがつ　みっか",
    },
    {
      q: "わたしの　（　　　　　　）は ４月２５日です。",
      options: ["たんじょうび", "たんじょび", "たんじょう", "たんしょうび"],
      answer: "たんじょうび",
    },
    {
      q: "１０月１０日",
      options: [
        "じゅうがつ　とおか",
        "じゅうがつ　じゅうにち",
        "とおがつ　とおか",
        "とおがつ　じゅうにち",
      ],
      answer: "じゅうがつ　とおか",
    },
    {
      q: "６月２０日",
      options: [
        "ろくがつ　はつか",
        "ろくがつ　にじゅうにち",
        "ろくがつ　はたち",
        "ろくがつ　じゅうににち",
      ],
      answer: "ろくがつ　はつか",
    },
    {
      q: "（　　　　　）の げつようびに がっこうへ いきました。",
      options: ["せんしゅう", "らいしゅう", "らいげつ", "きょねん"],
      answer: "せんしゅう",
    },
    {
      q: "A：きょうは　（　　　　　　　　）ですか。B：７月１０日です。",
      options: [
        "なんがつ　なんにち",
        "なんようび",
        "なんじから　なんじまで",
        "なんにち　なんがつ",
      ],
      answer: "なんがつ　なんにち",
    },
    {
      q: "２月１日",
      options: [
        "にがつ　ついたち",
        "にがつ　いちにち",
        "にがつ　ひとにち",
        "にがつ　とおか",
      ],
      answer: "にがつ　ついたち",
    },
    {
      q: "A：なにで　びょういんへ　いきましたか。B：（　　　　　　）で　いきました。",
      options: ["タクシー", "スーパー", "デパート", "ロビー"],
      answer: "タクシー",
    },
    {
      q: "A：だれと　にほんへ　きましたか。B：（　　　　　）と　きました。",
      options: ["かぞく", "わたし", "ひこうき", "ことし"],
      answer: "かぞく",
    },
    {
      q: "きのう　だれも　（　　　　　　　　　）。",
      options: [
        "べんきょうしませんでした",
        "べんきょうしましたか",
        "べんきょうしません",
        "べんきょうしますか",
      ],
      answer: "べんきょうしませんでした",
    },
    {
      q: "A：あした　どこへ　いきますか。B：（　　　　）いきません。",
      options: ["どこも", "どこへ", "どこから", "どこまで"],
      answer: "どこも",
    },
    {
      q: "（　　　　　）だいがくへ　いきました。",
      options: ["ひとりで", "ひとりと", "ひとりの", "ひとりは"],
      answer: "ひとりで",
    },
    {
      q: "（　　　　　）うちへ　かえります。",
      options: ["あるいて", "あるいてで", "あるきて", "あるいで"],
      answer: "あるいて",
    },
    {
      q: "A：（　　　　）　スーパーへ　いきますか。B：じてんしゃで　いきます。",
      options: ["なにで", "なんの", "なにから", "なにと"],
      answer: "なにで",
    },
    {
      q: "ひこうき（　 　）ちゅうごくへ　かえります。",
      options: ["で", "へ", "と", "は"],
      answer: "で",
    },
    {
      q: "A：（　　　　）びじゅつかんへ　いきますか。B：かのじょと いきます。",
      options: ["だれと", "なにで", "どこへ", "だれの"],
      answer: "だれと",
    },
    {
      q: "ともだち（　　 ）がっこうへ　いきます。",
      options: ["と", "を", "へ", "まで"],
      answer: "と",
    },
    {
      q: "A：つぎの でんしゃは（　　　　　）きますか。B：２じ　１５ふんに　きます。",
      options: ["なんじに", "どこへ", "どこから", "なんかい"],
      answer: "なんじに",
    },
    {
      q: "えき（　　　　）スーパーまで いきます。",
      options: ["から", "へ", "は", "も"],
      answer: "から",
    },
    {
      q: "A：リンさんは　どこへ　いきますか。B：（　　　　　）へ いきます。",
      options: ["ぎんこう", "ざっし", "かいしゃいん", "ふね"],
      answer: "ぎんこう",
    },
    {
      q: "８じに　うちへ（　　　　　　　）。",
      options: ["かえります", "きます", "いきます", "やすみます"],
      answer: "かえります",
    },
    {
      q: "A：（　　）バスは としょかんへ　いきますか。B：はい、いきますよ。",
      options: ["つぎの", "つぎと", "つぎは", "つぎから"],
      answer: "つぎの",
    },
    {
      q: "A：どこ（　　　　）きましたか。B：アメリカ です。",
      options: ["から", "まで", "と", "なに"],
      answer: "から",
    },
    {
      q: "A：キムさんは（　　　　　）へ いきましたか。B：スーパーへ　いきました。",
      options: ["どこ", "なに", "だれ", "なん"],
      answer: "どこ",
    },
    {
      q: "たなかさんは（　　　　　）へ　いきました。",
      options: ["かいしゃ", "でんしゃ", "つくえ", "いしゃ"],
      answer: "かいしゃ",
    },
    {
      q: "ここから　えき（　　　　）いくらですか。",
      options: ["まで", "は", "の", "へ"],
      answer: "まで",
    },
    {
      q: "わたしは　びょういん（　　　）いきます。",
      options: ["へ", "で", "と", "から"],
      answer: "へ",
    },
    {
      q: "A：ここで　しゃしんを　（　　　　　）。B：はい。",
      options: ["とりましょう", "しましょう", "のみましょう", "よみましょう"],
      answer: "とりましょう",
    },
    {
      q: "A：ともだちと　おはなみを　します。いっしょに　（　　　　）。B：いいですね。",
      options: ["しませんか", "かいませんか", "みませんか", "すいませんか"],
      answer: "しませんか",
    },
    {
      q: "A：じゃ、１０じに　えきで　（　　　　　　）。B：わかりました。",
      options: ["あいましょう", "あいますか", "あいましたか", "あいません"],
      answer: "あいましょう",
    },
    {
      q: "A：にちようび　サッカーを　しませんか。B：にちようびは（　　　　　　）。",
      options: ["ちょっと", "ええと", "ほんとう", "そっと"],
      answer: "ちょっと",
    },
    {
      q: "A：こんばん　いっしょに　ごはんを　たべませんか。B：いいですね。（　　　　　　）。",
      options: ["たべましょう", "たべません", "たべました", "たべませんでした"],
      answer: "たべましょう",
    },
    {
      q: "A：（　　　　）に　ビールを　のみませんか。B：ビールは　ちょっと。",
      options: ["いっしょ", "いしょう", "いっしょう", "いしょい"],
      answer: "いっしょ",
    },
    {
      q: "A：いっしょに　えいがを　（　　　　　）。B：いいですね。みましょう。",
      options: ["みませんか", "みましょうか", "みましたか", "みないか"],
      answer: "みませんか",
    },
    {
      q: "A：どこで　サッカーを　しますか。B：（　　　　　）します。",
      options: ["がっこうで", "がっこうへ", "がっこうを", "がっこうの"],
      answer: "がっこうで",
    },
    {
      q: "にほんで　おはなみを　（　　　　　）。",
      options: ["します", "いきます", "みます", "たべます"],
      answer: "します",
    },
    {
      q: "えき（　　　）　ともだちに　あいます。",
      options: ["で", "へ", "の", "も"],
      answer: "で",
    },
    {
      q: "A：（　　　　）　べんきょうしますか。B：うちで　べんきょうします。",
      options: ["どこで", "どこに", "どこへ", "どこは"],
      answer: "どこで",
    },
    {
      q: "A：にちようび　なにを　（　　　　　）。B：レストランへ　いきます。",
      options: ["しますか", "いきますか", "ねますか", "おきますか"],
      answer: "しますか",
    },
    {
      q: "きのう　テレビを　（　　　　　）。",
      options: ["みました", "いきました", "しました", "あいました"],
      answer: "みました",
    },
    {
      q: "キムさんは　ぶたにく（　　　）　たべます。",
      options: ["を", "に", "と", "へ"],
      answer: "を",
    },
    {
      q: "はし（　　）　ごはんを　たべます。",
      options: ["で", "の", "を", "は"],
      answer: "で",
    },
    {
      q: "A：（　　　）かみを　きりますか。B：はさみで　きります。",
      options: ["なにで", "だれと", "なんの", "どこで"],
      answer: "なにで",
    },
    {
      q: "にほんご（　　）　レポートを　かきます。",
      options: ["で", "と", "を", "に"],
      answer: "で",
    },
    {
      q: "A：これは　（　　　　）で　なんですか。B：ホッチキスです。",
      options: ["にほんご", "にほん", "にほんじん", "にほんの"],
      answer: "にほんご",
    },
    {
      q: 'A：「ありがとう」は　えいごで　（　　　　　）。B："Thank you" です。',
      options: ["なんですか", "どこですか", "だれですか", "いつですか"],
      answer: "なんですか",
    },
    {
      q: "（　　　　）で　えを　かきます。",
      options: ["ボールペン", "セロテープ", "スプーン", "シャツ"],
      answer: "ボールペン",
    },
    {
      q: "A：なまえは　えいごで　かきますか。B：いいえ、にほんごの　（　　　　）で　かきます。",
      options: ["カタカナ", "えんぴつ", "てがみ", "ばんごう"],
      answer: "カタカナ",
    },
    {
      q: "わたしは　ともだち（　　　）　ほんを　あげました。",
      options: ["に", "から", "で", "と"],
      answer: "に",
    },
    {
      q: "（　　　　）に　このネクタイを　もらいました。",
      options: ["あに", "わたし", "ひと", "あそこ"],
      answer: "あに",
    },
    {
      q: "せんせいは　わたしたちに　にほんごを　（　　　　　）。",
      options: ["おしえます", "ならいます", "かします", "あげます"],
      answer: "おしえます",
    },
    {
      q: "ともだちに　てがみを　（　　　　　）。",
      options: ["おくりました", "かけました", "よみました", "あいました"],
      answer: "おくりました",
    },
    {
      q: "A：（　　　）に　でんわを　かけますか。B：かぞくに　かけます。",
      options: ["だれ", "いつ", "なに", "なん"],
      answer: "だれ",
    },
    {
      q: "A：どうぞ。おあがりください。B：（　　　　　　　）。",
      options: [
        "しつれいします",
        "しつれいです",
        "しつれいしました",
        "しつれいでした",
      ],
      answer: "しつれいします",
    },
    {
      q: "A：その　とけい、だれに　もらいましたか。B：（　　　　）もらいました。",
      options: ["ははに", "ははが", "ははと", "ははの"],
      answer: "ははに",
    },
    {
      q: "A：（　　　）　このえいがを　みましたか。B：いいえ、まだです。",
      options: ["もう", "そう", "よう", "こう"],
      answer: "もう",
    },
    {
      q: "A：もう　あさごはんを　（　　　　）か。B：はい。",
      options: ["たべました", "たべます", "たべません", "たべませんでした"],
      answer: "たべました",
    },
    {
      q: "A：もう　しゅくだいを　しましたか。B：いいえ、（　　　　）。",
      options: ["まだです", "まだ　しません", "まだでした", "しませんでした"],
      answer: "まだです",
    },
    {
      q: "A：もう　このほんを　よみましたか。B：いいえ、まだです。（　　　　）よみます。",
      options: ["これから", "それから", "あれから", "どれから"],
      answer: "これから",
    },
    {
      q: "A：おかあさんは　なんさいですか。B：（　　　）は　４０さいです。",
      options: ["はは", "ちち", "かか", "つま"],
      answer: "はは",
    },
    {
      q: "A：ごしゅじんの　おしごとは？B：（　　　）は　いしゃです。",
      options: ["おっと", "おくさん", "そふ", "あに"],
      answer: "おっと",
    },
    {
      q: "A：（　　　　）は　どちらですか。B：そぼは　うちです。",
      options: ["おばあさん", "おくさん", "おねえさん", "おじいさん"],
      answer: "おばあさん",
    },
  ],
  "文法・文の文法1（中盤レベル[10〜19か]）": [
    {
      q: "A：このかばんは　（　　　　）ですか。B：いいえ、ちいさいです。",
      options: ["おおきい", "あたらしい", "おいしい", "ふるい"],
      answer: "おおきい",
    },
    {
      q: "A：にほんごは　むずかしいですか。B：いいえ、あまり　（　　　　　　）。",
      options: [
        "むずかしくないです",
        "むずかしいじゃありません",
        "むずかしいないです",
        "むずかしじゃありません",
      ],
      answer: "むずかしくないです",
    },
    {
      q: "A：このコーヒーは　（　　　）ですか。B：とても　おいしいです。",
      options: ["どう", "なん", "どこ", "なに"],
      answer: "どう",
    },
    {
      q: "ファックスは　あまり　（　　　　　）。",
      options: [
        "べんりじゃありません",
        "べんりです",
        "べんりくないです",
        "べんりでした",
      ],
      answer: "べんりじゃありません",
    },
    {
      q: "すしは　おいしいです（　　）、たかいです。",
      options: ["が", "と", "で", "に"],
      answer: "が",
    },
    {
      q: "せんせいは　ハンサムです。そして　（　　　　　）。",
      options: ["しんせつです", "にがいです", "ひまです", "しずかです"],
      answer: "しんせつです",
    },
    {
      q: "A：しごとは　どうですか。B：そうですね。とても　（　　　　）。",
      options: ["おもしろいです", "どうです", "ゆうめいです", "げんきです"],
      answer: "おもしろいです",
    },
    {
      q: "たなかさんは とても　（　　　　）人ひとです。",
      options: ["ハンサムな", "ハンサムの", "ハンサム", "ハンサムと"],
      answer: "ハンサムな",
    },
    {
      q: "A：ふじさんは　（　　　　）やまですか。B：ゆうめいな　やまです。",
      options: ["どんな", "どう", "なんの", "どこの"],
      answer: "どんな",
    },
    {
      q: "これは　（　　　　）くつです。きのう　かいました。",
      options: ["あたらしい", "あたらしいな", "あたらしいの", "あたらしな"],
      answer: "あたらしい",
    },
    {
      q: "A：マリアさんの　かさは　（　　　）ですか。B：あの　あおい　かさです。",
      options: ["どれ", "なに", "どう", "なん"],
      answer: "どれ",
    },
    {
      q: "A：ふるさとは　どんな　ところですか。B：（　　　　　）ところです。",
      options: ["しずかな", "あまい", "ひくい", "くろい"],
      answer: "しずかな",
    },
    {
      q: "A：あの　（　　　）くるまは　だれのですか。B：たけださんのです。",
      options: ["きいろい", "すっぱい", "いそがしい", "たのしい"],
      answer: "きいろい",
    },
    {
      q: "その　（　　　　）かばんは　わたしのです。",
      options: ["みどりの", "みどりな", "みどりい", "みどり"],
      answer: "みどりの",
    },
    {
      q: "わたしは　サッカー（　　）すきです。",
      options: ["が", "を", "で", "の"],
      answer: "が",
    },
    {
      q: "A：すいえいが　すきですか。B：すきですが、あまり　（　　　　　）じゃありません。",
      options: ["じょうず", "きらい", "すき", "へた"],
      answer: "じょうず",
    },
    {
      q: "A：よく　この　スーパーへ　いきますか。B：（　　　　）いきます。",
      options: ["ときどき", "だいたい", "ぜんぜん", "すこし"],
      answer: "ときどき",
    },
    {
      q: "すずきさんは　フランスごが　すこし　（　　　　　）。",
      options: ["わかります", "あります", "いいです", "みます"],
      answer: "わかります",
    },
    {
      q: "A：どんな　（　　　　）が　すきですか。B：テニスが　すきです。",
      options: ["スポーツ", "コンサート", "やきゅう", "カラオケ"],
      answer: "スポーツ",
    },
    {
      q: "A：かんじが　わかりますか。B：いいえ、（　　　　）わかりません。",
      options: ["ぜんぜん", "たくさん", "いつも", "だいたい"],
      answer: "ぜんぜん",
    },
    {
      q: "A：おくさんは　りょうりが　じょうずですか。B：いいえ、（　　　　）です。",
      options: ["へた", "きらい", "わるい", "むずかしい"],
      answer: "へた",
    },
    {
      q: "A：あした　いっしょに　レストランへ　いきませんか。B：すみません、あしたは　ようじが　あります（　　　）。",
      options: ["から", "まで", "か", "です"],
      answer: "から",
    },
    {
      q: "A：（　　　　）さかなが　きらいですか。B：おいしくないですから。",
      options: ["どうして", "いつ", "なにで", "どう"],
      answer: "どうして",
    },
    {
      q: "A：どうして　にほんごを　べんきょうしますか。B：（　　　　　　　）から。",
      options: [
        "にほんで　はたらきます",
        "にほんは　ちいさいです",
        "にほんごは　しんせつです",
        "にほんじんは　むずかしいです",
      ],
      answer: "にほんで　はたらきます",
    },
    {
      q: "A：どうして　きのう　（　　　　　）か。B：あまり　げんきじゃ　ありませんでしたから。",
      options: [
        "やすみました",
        "はたらきました",
        "べんきょうしました",
        "わかりました",
      ],
      answer: "やすみました",
    },
    {
      q: "A：こんばん　いっしょに　おさけを　のみませんか。B：すみません。ともだちと（　　　　）が ありますから。",
      options: ["やくそく", "おさけ", "じかん", "たくさん"],
      answer: "やくそく",
    },
    {
      q: "（　　　　）がありませんから、タクシーで いきましょう。",
      options: ["じかん", "やくそく", "ようじ", "ようび"],
      answer: "じかん",
    },
    {
      q: "ようじが　ありますから、（　　　　）かえります。",
      options: ["はやく", "よく", "たくさん", "すこし"],
      answer: "はやく",
    },
    {
      q: "きょうしつに　つくえが　（　　　　）。",
      options: ["あります", "います", "します", "あいます"],
      answer: "あります",
    },
    {
      q: "へやに　（　　　　　）が　います。",
      options: ["おとこの人ひと", "スイッチ", "えんぴつ", "なに"],
      answer: "おとこの人ひと",
    },
    {
      q: "A：しんしつに　（　　　）が　ありますか。B：ベッドが　あります。",
      options: ["なに", "どこ", "だれ", "なん"],
      answer: "なに",
    },
    {
      q: "A：かいぎしつに　（　　　）が　いますか。B：いまいさんが　います。",
      options: ["だれ", "どれ", "なに", "どう"],
      answer: "だれ",
    },
    {
      q: "A：こうえんに　（　　　）が　いますか。B：いぬが　います。",
      options: ["なに", "だれ", "なん", "どこ"],
      answer: "なに",
    },
    {
      q: "A：つくえの　したに　なにが　いますか。B：（　　　）が　います。",
      options: ["ねこ", "おとこのこ", "でんわ", "まど"],
      answer: "ねこ",
    },
    {
      q: "ほんやの　となり（　　）　きっさてんが　あります。",
      options: ["に", "で", "へ", "を"],
      answer: "に",
    },
    {
      q: "A：スイッチは　（　　　）に　ありますか。B：まどの　みぎに　あります。",
      options: ["どこ", "なん", "なに", "だれ"],
      answer: "どこ",
    },
    {
      q: "A：たけださんは？B：しょくどう（　　）います。",
      options: ["に", "は", "で", "へ"],
      answer: "に",
    },
    {
      q: "ポストは　ゆうびんきょくの　まえに　（　　　　）。",
      options: ["あります", "です", "います", "します"],
      answer: "あります",
    },
    {
      q: "A：いぬ（　）　どこに　いますか。B：にわに　います。",
      options: ["は", "が", "の", "や"],
      answer: "は",
    },
    {
      q: "A：せんめんじょは　どこに　ありますか。B：この　ろうかの　（　　）に　あります。",
      options: ["おく", "たな", "まど", "なか"],
      answer: "おく",
    },
    {
      q: "A：つくえの　うえに　なにが　ありますか。B：ほん（　　）ざっしなどが　あります。",
      options: ["や", "と", "は", "の"],
      answer: "や",
    },
    {
      q: "こうえんに（　　　　）人ひとが　います。",
      options: ["いろいろな", "いらいらな", "いるいるな", "いれいれな"],
      answer: "いろいろな",
    },
    {
      q: "りんごを　（　　　）　かいます。",
      options: ["ふたつ", "ふたり", "ふつか", "ふっつ"],
      answer: "ふたつ",
    },
    {
      q: "レポートを　１０（　　）　書かきました。",
      options: ["まい", "だい", "にん", "かい"],
      answer: "まい",
    },
    {
      q: "A：くるまが　（　　　　）ありますか。B：１だい　あります。",
      options: ["なんだい", "いくつ", "いくだい", "なにだい"],
      answer: "なんだい",
    },
    {
      q: "わたしは　きょうだいが　（　　　）います。",
      options: ["よにん", "よんにん", "しにん", "ようにん"],
      answer: "よにん",
    },
    {
      q: "A：パンを　（　　　　）食たべますか。B：みっつ　食たべます。",
      options: ["いくつ", "なんつ", "いつつ", "どうつ"],
      answer: "いくつ",
    },
    {
      q: "わたしは　かぞくが　５人にん　います。ちちと　ははと　あねが　（　　　　）います。",
      options: ["ふたり", "ひとり", "よにん", "はちにん"],
      answer: "ふたり",
    },
    {
      q: "ここに　けしゴムが　（　　　）あります。",
      options: ["とお", "とおつ", "じゅっつ", "じゅうつ"],
      answer: "とお",
    },
    {
      q: "ここで　１（　　　）　　日本語にほんごを　べんきょうしました。",
      options: ["かげつ", "げつ", "がつ", "かがつ"],
      answer: "かげつ",
    },
    {
      q: "１しゅうかん（　　）　２かい　休やすみます。",
      options: ["に", "は", "の", "から"],
      answer: "に",
    },
    {
      q: "うちから　がっこうまで　あるいて　３０ぷん　（　　　　　）。",
      options: ["かかります", "いきます", "かえります", "わかります"],
      answer: "かかります",
    },
    {
      q: "A：日本にほんから　ベトナムまで　（　　　　　）かかりますか。B：ひこうきで　６じかんぐらい　かかります。",
      options: ["どのくらい", "どんな", "どうくらい", "どうして"],
      answer: "どのくらい",
    },
    {
      q: "A：１にちに　（　　　）　タバコを　すいますか。B：１０かいぐらい　すいます。",
      options: ["なんかい", "なんがい", "なんねん", "なんさい"],
      answer: "なんかい",
    },
    {
      q: "A：カレーライスと、サラダと、ビール、（　　　　）　いくらですか。B：2500えん　です。",
      options: ["ぜんぶで", "みんな", "みなさん", "たくさん"],
      answer: "ぜんぶで",
    },
    {
      q: "オーストラリアまで　ふなびん（　　）　２かげつぐらい　かかります。",
      options: ["で", "の", "と", "を"],
      answer: "で",
    },
    {
      q: "きのうの　テストは　とても　（　　　　　　）。",
      options: [
        "むずかしかったです",
        "むずかしいでした",
        "むずかしかったでした",
        "むずかかったです",
      ],
      answer: "むずかしかったです",
    },
    {
      q: "A：りょこうは　どうでしたか。B：たのしかったです。てんきが　（　　　　　）。",
      options: ["よかったです", "いいでした", "いかったです", "よいでした"],
      answer: "よかったです",
    },
    {
      q: "A：せんしゅうの　おまつりは　（　　　　　）。B：人ひとが　おおかったです。",
      options: ["どうでしたか", "どうですか", "どんなでしたか", "どんなですか"],
      answer: "どうでしたか",
    },
    {
      q: "きょねん　わたしは　学生がくせい（　　　　）。いま　かいしゃいんです。",
      options: ["でした", "です", "ました", "しました"],
      answer: "でした",
    },
    {
      q: "A：ワインは　おいしかったですか。B：いいえ、あまり（　　　　　　　）。",
      options: [
        "おいしくなかったです",
        "おいしいじゃありません",
        "おいしかったです",
        "おいしいじゃありませんでした",
      ],
      answer: "おいしくなかったです",
    },
    {
      q: "せんしゅうは　ぜんぜん　ひま（　　　　　　）。",
      options: [
        "じゃありませんでした",
        "でした",
        "じゃありません",
        "なかったです",
      ],
      answer: "じゃありませんでした",
    },
    {
      q: "A：きのうの　てんきは　どうでしたか。B：（　　　　　　）。",
      options: ["あめでした", "あめです", "あめました", "あめます"],
      answer: "あめでした",
    },
    {
      q: "ひこうきは　ふね（　　　）はやいです。",
      options: ["より", "から", "まで", "のほうが"],
      answer: "より",
    },
    {
      q: "にくは　やさいより　（　　　　　）です。",
      options: ["高たかい", "にぎやか", "食たべもの", "さむい"],
      answer: "高たかい",
    },
    {
      q: "いぬと　ねこと　（　　　　）すきですか。",
      options: ["どちらが", "だれが", "なにが", "どれが"],
      answer: "どちらが",
    },
    {
      q: "A：日本語にほんごと、えい語ごと　どちらが　むずかしいですか。B：日本語にほんご（　　　　）　むずかしいです。",
      options: ["のほうが", "ほうが", "がほうの", "ほうの"],
      answer: "のほうが",
    },
    {
      q: "A：うどんと　そばと　どちらが　すきですか。B：（　　　　）　すきです。",
      options: ["どちらも", "どちらが", "どちらの", "どちらか"],
      answer: "どちらも",
    },
    {
      q: "A：タブレットは　パソコンより　べんりですか。B：いいえ、パソコン（　　　　）　べんりですよ。",
      options: ["のほうが", "より", "まで", "からも"],
      answer: "のほうが",
    },
    {
      q: "A：お父とうさん（　　）　お母かあさんと　どちらが　おもしろいですか。B：父ちちの　ほうが　おもしろいです。",
      options: ["と", "の", "や", "も"],
      answer: "と",
    },
    {
      q: "スポーツで　テニスが　（　　　　）すきです。",
      options: ["いちばん", "いっかい", "いちにち", "いっしょに"],
      answer: "いちばん",
    },
    {
      q: "きせつで　（　　　　）が　いちばん　すきですか。",
      options: ["いつ", "どこ", "なん", "だれ"],
      answer: "いつ",
    },
    {
      q: "日本にほん（　　）　どこが　いちばん　ゆうめいですか。",
      options: ["で", "へ", "と", "が"],
      answer: "で",
    },
    {
      q: "A：日本にほんの　食たべもので　なにが　いちばん　すきですか。B：すきやき（　　）　いちばん　すきです。",
      options: ["が", "と", "の", "を"],
      answer: "が",
    },
    {
      q: "A：かいしゃで　（　　　　）が　いちばん　ハンサムですか。B：たなかさんですよ。",
      options: ["だれ", "なに", "いつ", "どれ"],
      answer: "だれ",
    },
    {
      q: "A：おまつりで　なにが　いちばん　（　　　　　　）か。B：そうですね。ビールが　おいしかったです。",
      options: ["よかったです", "よいです", "よくないです", "よいでした"],
      answer: "よかったです",
    },
    {
      q: "A：（　　　）で　だれが　いちばん　りょうりが　じょうずですか。B：母ははが　いちばん　じょうずです。",
      options: ["かぞく", "ともだち", "がっこう", "みなさん"],
      answer: "かぞく",
    },
    {
      q: "きれいな　かのじょ（　　）　ほしいです。",
      options: ["が", "を", "の", "と"],
      answer: "が",
    },
    {
      q: "お金かねが　たくさん　（　　　　）です。",
      options: ["ほしい", "たい", "ありたい", "いたい"],
      answer: "ほしい",
    },
    {
      q: "のどが　かわきましたから、ジュースを　（　　　　　）です。",
      options: ["のみたい", "のみます", "ほしい", "したい"],
      answer: "のみたい",
    },
    {
      q: "A：大学だいがくで　なにを　べんきょう（　　　　）ですか。B：せかいの　けいざいです。",
      options: ["したい", "する", "します", "しない"],
      answer: "したい",
    },
    {
      q: "大おおきい　うちが　ほしいです。　いまの　うちは　（　　　　）から。",
      options: ["せまいです", "あかいです", "きれいです", "すずしいです"],
      answer: "せまいです",
    },
    {
      q: "A：この本ほん、よみたいですか。B：いいえ、あまり　（　　　　　　　）。    むずかしいですから。",
      options: [
        "よみたくないです",
        "よみたいじゃありません",
        "よみたいでした",
        "よみませんたいです",
      ],
      answer: "よみたくないです",
    },
    {
      q: "A：いま　なにが　いちばん　ほしいですか。B：時間じかん（　　）　ほしいです。",
      options: ["が", "を", "で", "も"],
      answer: "が",
    },
    {
      q: "日にちよう日び　プールへ　およぎ（　　）行いきました。",
      options: ["に", "は", "へ", "で"],
      answer: "に",
    },
    {
      q: "A：デパートで なにを しますか。B：くつを（　　　　）に行いきます。",
      options: ["かい", "かお", "かう", "かき"],
      answer: "かい",
    },
    {
      q: "A：なつ休やすみ（　　　）か行いきますか。B：うみへ　行いきます。",
      options: ["どこ", "なに", "いつ", "どれ"],
      answer: "どこ",
    },
    {
      q: "A：おなかが すきましたね。B：レストランで（　　　　）食たべましょう。",
      options: ["なにか", "なにを", "なにも", "なにで"],
      answer: "なにか",
    },
    {
      q: "A：とうきょうへ　なにを　（　　　）行いきますか。B：すもうを　見みに　行いきます。",
      options: ["しに", "すに", "きに", "こに"],
      answer: "しに",
    },
    {
      q: "あした　かれと　レストランへ　（　　　　）に　行いきます。",
      options: ["しょくじ", "たべる", "たべもの", "しょくじする"],
      answer: "しょくじ",
    },
    {
      q: "ともだちを　むかえに　くうこう（　　）行いきます。",
      options: ["まで", "が", "を", "で"],
      answer: "まで",
    },
    {
      q: "A：すみません、まどを　（　　　　）ください。B：わかりました。",
      options: ["しめて", "しまって", "しめれて", "しめって"],
      answer: "しめて",
    },
    {
      q: "A：しゃしんを　（　　　　）ください。B：いいですよ。",
      options: ["とって", "とりて", "とんで", "とるて"],
      answer: "とって",
    },
    {
      q: "A：ここを　（　　　　）ください。B：はい。わかりました。",
      options: ["よんで", "よみて", "よみで", "よむで"],
      answer: "よんで",
    },
    {
      q: "あそこを　ひだり（　　）　まがってください。",
      options: ["へ", "で", "を", "が"],
      answer: "へ",
    },
    {
      q: "（　　　　）行いってください。",
      options: ["まっすぐ", "みぎ", "ひだり", "うしろ"],
      answer: "まっすぐ",
    },
    {
      q: "A：パスポート（　　）　見みせてください。B：はい、どうぞ。",
      options: ["を", "が", "で", "へ"],
      answer: "を",
    },
    {
      q: "A：ちょっと　（　　　　　　　　）。B：なんですか。",
      options: [
        "まってください",
        "まちてください",
        "まいてください",
        "ましてください",
      ],
      answer: "まってください",
    },
    {
      q: "A：にもつを　ひとつ　（　　　　　）。B：ありがとうございます。おねがいします。",
      options: [
        "もちましょうか",
        "もちましたか",
        "もちませんか",
        "もっていますか",
      ],
      answer: "もちましょうか",
    },
    {
      q: "A：ワンさんは？B：いま しょくどうで ごはんを　（　　　　　）。",
      options: [
        "食たべています",
        "食たべていましょう",
        "食たべました",
        "食たべてください",
      ],
      answer: "食たべています",
    },
    {
      q: "A：なにを　（　　　）いますか。B：えを　かいて　います。",
      options: ["して", "しって", "しいて", "しんで"],
      answer: "して",
    },
    {
      q: "A：なにか　てつだいましょうか。B：いいえ、（　　　　　）。",
      options: ["けっこうです", "なかなかです", "ちょっとです", "たくさんです"],
      answer: "けっこうです",
    },
    {
      q: "A：じゅうしょを　かきましょうか。B：はい、かいて（　　　　）。",
      options: ["ください", "おねがいします", "ましょう", "います"],
      answer: "ください",
    },
    {
      q: "いま　雨あめが　（　　　　　　）。",
      options: ["ふっています", "ふりました", "ふってました", "ふりています"],
      answer: "ふっています",
    },
    {
      q: "A：きむらさんは　（　　　　）　はなしていますか。B：ケビンさんです。",
      options: ["だれと", "どこで", "なんで", "なんの"],
      answer: "だれと",
    },
    {
      q: "A：たなかさんの　じゅうしょを　しっていますか。B：いいえ、（　　　　）。おしえてください。",
      options: [
        "しりません",
        "しっていません",
        "しりませんでした",
        "しっていませんでした",
      ],
      answer: "しりません",
    },
    {
      q: "A：お母かあさんは　なにを　していますか。B：母ははは　大学だいがくで　日本語にほんごを　（　　　　　　）。",
      options: [
        "おしえています",
        "おしえてください",
        "おしえてもいいです",
        "おしえてはいけません",
      ],
      answer: "おしえています",
    },
    {
      q: "A：このさっかを　（　　　　　）か。B：はい、とても　ゆうめいです。",
      options: ["しっています", "しています", "しりています", "しいています"],
      answer: "しっています",
    },
    {
      q: "A：先生せんせいは　けっこん（　　　　　）か。B：いいえ、どくしんですよ。",
      options: ["しています", "しません", "していました", "しましょう"],
      answer: "しています",
    },
    {
      q: "A：ようじが　ありますから、はやく（　　　　　　）も　いいですか。B：わかりました。どうぞ。",
      options: ["かえって", "みて", "すんで", "たって"],
      answer: "かえって",
    },
    {
      q: "A：ちょっと　トイレへ　行いっても　いいですか。B：ええ。（　　　　　　）よ。",
      options: ["いいです", "行いきます", "そうです", "よかったです"],
      answer: "いいです",
    },
    {
      q: "このいす（　　）　すわっても　いいですか。",
      options: ["に", "で", "を", "が"],
      answer: "に",
    },
    {
      q: "ここで　話はなしては　いけません。あそこで　話はなして（　　　　）。",
      options: ["ください", "は　いけます", "います", "いいます"],
      answer: "ください",
    },
    {
      q: "A：しゃしんを　とっても　（　　　　）か。B：すみません、ちょっと。",
      options: ["いいです", "いけません", "いいます", "いいません"],
      answer: "いいです",
    },
    {
      q: "ここで　たばこを　すっては　（　　　　）。",
      options: ["いけません", "いいです", "よくないです", "わるいです"],
      answer: "いけません",
    },
    {
      q: "A：この電話でんわを　（　　　　）も　いいですか。B：ええ、どうぞ。",
      options: ["つかって", "つかわなくて", "つかいて", "つかいまして"],
      answer: "つかって",
    },
    {
      q: "うちへ　（　　　　）、ごはんを　食たべて、それから　ねます。",
      options: ["かえって", "かえりと", "かえります", "かえりって"],
      answer: "かえって",
    },
    {
      q: "A：ばんごはんを　食たべて（　　　）　なにを　しますか。B：しゅくだいを　します。",
      options: ["から", "まで", "きて", "いて"],
      answer: "から",
    },
    {
      q: "A：がっこうまで　（　　　　　）　行いきますか。B：えきまで　あるいて　行いって、なごやえきで　おりて、それから 5分ふんぐらい あるきます。",
      options: ["どうやって", "どうして", "どういって", "どんな"],
      answer: "どうやって",
    },
    {
      q: "（　　　）カードを　いれて、それから　ボタンを　おします。",
      options: ["まず", "それから", "やっと", "どう"],
      answer: "まず",
    },
    {
      q: "きのうのばん　えいがを　見みて、本ほんを　読よんで、　（　　　　）ねました。",
      options: ["それから", "どれから", "あれから", "これから"],
      answer: "それから",
    },
    {
      q: "かわさきえき（　　）のりかえて、よこはまえきで　おります。",
      options: ["で", "へ", "を", "に"],
      answer: "で",
    },
    {
      q: "A：大学だいがくを　（　　　）から　なにを　しますか。B：くるまの　かいしゃで　はたらきたいです。",
      options: ["出でて", "入はいって", "行いって", "きて"],
      answer: "出でて",
    },
    {
      q: "フランスは　ワイン（　　）　ゆうめいです。",
      options: ["が", "の", "を", "に"],
      answer: "が",
    },
    {
      q: "すずきさんは　（　　　）が　ながいです。",
      options: ["かみ", "め", "くち", "からだ"],
      answer: "かみ",
    },
    {
      q: "とうきょうは　人ひとが　（　　　　）、にぎやかな　ところです。",
      options: ["多おおくて", "大おおきくて", "多おおいて", "大おおきいて"],
      answer: "多おおくて",
    },
    {
      q: "サラさんは　（　　　　）、たのしい　人ひとです。",
      options: ["しんせつで", "しんせつの", "しんせつて", "しんせつに"],
      answer: "しんせつで",
    },
    {
      q: "雨あめが ふっていますから、まどを（　　　　）ください。",
      options: ["あけないで", "あかないで", "あきないで", "あくないで"],
      answer: "あけないで",
    },
    {
      q: "あしたは おふろに（　　　　）ください。",
      options: [
        "入はいらないで",
        "入はいりて",
        "入はいらなくて",
        "入はいりないで",
      ],
      answer: "入はいらないで",
    },
    {
      q: "A：この しりょうを もって行いきましょうか。B：いいえ、まだ使つかいますから、（　　　　　　　）。",
      options: [
        "もって行いかないでください",
        "もって行いってください",
        "もたないでください",
        "もって行いきないでください。",
      ],
      answer: "もって行いかないでください",
    },
    {
      q: "このへやは（　　　）ですから、たばこを すわないでください。",
      options: ["きんえん", "びょうき", "ざんぎょう", "ねんざ"],
      answer: "きんえん",
    },
    {
      q: "A：まだ　ねつが　ありますから、（　　）日にち、休やすんでください。B：わかりました。",
      options: ["２、３", "１、２", "３、２", "２、１"],
      answer: "２、３",
    },
    {
      q: "レポートは　金曜日きんようび（　　　）　出だしてください。",
      options: ["までに", "まで", "から", "からに"],
      answer: "までに",
    },
    {
      q: "５時じ（　　　　）　休やすみましょう。",
      options: ["まで", "までに", "からで", "からに"],
      answer: "まで",
    },
    {
      q: "A：ここで　しょくじしても　いいですか。B：飲のみものを飲のんでも（　　）（　★　）（　　）（　　）ください。",
      options: ["が", "いいです", "食たべものを", "食たべないで"],
      answer: "が",
    },
    {
      q: "しごとが　おわりませんから、ざんぎょう（　　　　）。",
      options: [
        "しなければ　なりません",
        "しなくても　なりません",
        "しても　なりません",
        "しなければ　なります",
      ],
      answer: "しなければ　なりません",
    },
    {
      q: "A：今いま　お金かねを　はらわなければ　なりませんか。B：いいえ、（　　　　　　）いいです。",
      options: [
        "はらわなくても",
        "はらわなければ",
        "はらっても",
        "はらわないから",
      ],
      answer: "はらわなくても",
    },
    {
      q: "A：こんばん　いっしょに　ビールを　飲のみませんか。B：すみません、きょうは　はやく　うちへ　（　　　　　　　　）。",
      options: [
        "かえらなければ　なりません",
        "かえらないでください",
        "かえってもいいです",
        "かえりませんでした",
      ],
      answer: "かえらなければ　なりません",
    },
    {
      q: "A：うわぎを　（　　　　　）。したぎは ぬがなくても　いいです。B：わかりました。",
      options: [
        "ぬいでください",
        "ぬがないでください",
        "ぬぎませんか",
        "ぬいで　います",
      ],
      answer: "ぬいでください",
    },
  ],
  "文法・文の文法1（後半レベル[20〜27か]）": [
    {
      q: "わたしは ピアノを ひく（　　　）が できます。",
      options: ["こと", "もの", "とき", "かた"],
      answer: "こと",
    },
    {
      q: "A：ケリーさんは　ダンス（　　）できますか。B：はい、すこし できます。",
      options: ["が", "で", "を", "に"],
      answer: "が",
    },
    {
      q: "父ちちは　フランス人じんですから、フランス語ごを（　　　　）ことが　できます。",
      options: ["話はなす", "話はなした", "話はなし", "話はなさ"],
      answer: "話はなす",
    },
    {
      q: "A：このみせは　カードで　（　　　　）ことが　できますか。B：すみません、げんきんで　おねがいします。",
      options: ["はらう", "もつ", "つくる", "だす"],
      answer: "はらう",
    },
    {
      q: "A：かいぎが　ありますから、３時じまで　しゃちょうに　会あうことが　（　　　　　）。B：わかりました。３時じまで　まちましょう。",
      options: ["できません", "できます", "できました", "できませんでした"],
      answer: "できません",
    },
    {
      q: "A：車くるま（　　）　うんてんすることが　できますか。B：いいえ、できません。",
      options: ["を", "の", "で", "が"],
      answer: "を",
    },
    {
      q: "A：アプリで　ひこうきを　よやく（　　　）ことが　できますよ。B：へえ、べんりですね。",
      options: ["する", "かう", "とる", "うる"],
      answer: "する",
    },
    {
      q: "わたしの　しゅみは　しゃしんを　（　　　　）ことです。",
      options: ["とる", "とり", "とら", "とって"],
      answer: "とる",
    },
    {
      q: "まいばん　ねる（　　　）、おいのりを　します。",
      options: ["前まえに", "前まえで", "前まえを", "前まえへ"],
      answer: "前まえに",
    },
    {
      q: "クリスマス（　　）前まえに、プレゼントを買かいます。",
      options: ["の", "に", "は", "で"],
      answer: "の",
    },
    {
      q: "たなかさんの　しごとは　えを　かく（　　　）です。",
      options: ["こと", "こう", "これ", "この"],
      answer: "こと",
    },
    {
      q: "インドネシアりょうりを　（　　　　）ことが　あります。",
      options: ["食たべた", "食たべ", "食たべて", "食たべます"],
      answer: "食たべた",
    },
    {
      q: "A：このえいがを　見みた　ことが　ありますか。B：いいえ、（　　　　　　）。",
      options: [
        "ありません",
        "見みません",
        "ありませんでした",
        "見みませんでした",
      ],
      answer: "ありません",
    },
    {
      q: "（　　　　）ゆきを見みた ことが ありません。",
      options: ["いちども", "いちど", "なんかいも", "にかい"],
      answer: "いちども",
    },
    {
      q: "A：このデパートへ　行いった　ことが　ありますか。B：ええ、（　　　　）ありますよ。",
      options: ["なんかいも", "だんだん", "もうすぐ", "いちども"],
      answer: "なんかいも",
    },
    {
      q: "ふじさん（　　）のぼった ことが あります。",
      options: ["に", "で", "が", "から"],
      answer: "に",
    },
    {
      q: "A：外国がいこくへ行いった　ことが　ありますか。B：いいえ、ありません。（　　　）行いきたいです。",
      options: ["ぜひ", "へえ", "もし", "いえ"],
      answer: "ぜひ",
    },
    {
      q: "A：今日きょうは　あまり　食たべませんね。どうしましたか。B：（　　　　）ダイエットを しています。",
      options: ["じつは", "だんだん", "しかし", "なかなか"],
      answer: "じつは",
    },
    {
      q: "A：休やすみの日ひに　何なにを　していますか。B：買かいものした（　　）、本ほんを読よんだ（　　）、しています。",
      options: ["り　り", "ら　ら", "と　と", "や　や"],
      answer: "り　り",
    },
    {
      q: "日本にほんで　スキーを　（　　　）り、 お花見はなみを（　　　）り、したいです。",
      options: ["した　した", "する　する", "して　して", "すた　すた"],
      answer: "した　した",
    },
    {
      q: "A：つかれて　（　　　　）なりました。B：ちょっと　休やすみましょう。",
      options: ["ねむく", "ねむい", "ねむいに", "ねむいく"],
      answer: "ねむく",
    },
    {
      q: "A：しょうらい　いしゃ（　　）なりたいです。B：じゃ、たくさん勉強べんきょうしなければ なりませんね。",
      options: ["に", "の", "が", "を"],
      answer: "に",
    },
    {
      q: "A：あした がっこうへ（　　　）？B：ううん、行いかない。",
      options: ["行いく", "行いった", "行いきました", "行いかなかった"],
      answer: "行いく",
    },
    {
      q: "きのうは何なにも（　　　　　）。",
      options: ["しなかった", "しない", "しないでした", "した"],
      answer: "しなかった",
    },
    {
      q: "A：この　えいがを　もう　見みた？B：（　　　）。おもしろかったよ。",
      options: ["うん", "ううん", "うんうん", "うーん"],
      answer: "うん",
    },
    {
      q: "A：ホテルは　（　　　　　）？B：とても　きれいだった。",
      options: ["どうだった", "どうかった", "どうました", "どうった"],
      answer: "どうだった",
    },
    {
      q: "この本ほんは　あまり（　　　　　）。",
      options: [
        "おもしろくない",
        "おもしろい",
        "おもしろかった",
        "おもしろじゃない",
      ],
      answer: "おもしろくない",
    },
    {
      q: "A：らいしゅうの　金曜日きんようび　何なにを する？B：えいがを　（　　　　）よ。",
      options: [
        "見みに行いく",
        "見みるに行いく",
        "見みに行いった",
        "見みるに行いった",
      ],
      answer: "見みに行いく",
    },
    {
      q: "A：きのうの　テストは　どうだった？B：とても　（　　　　　）。",
      options: [
        "むずかしかった",
        "むずかしいだった",
        "むずかかった",
        "むずかしだった",
      ],
      answer: "むずかしかった",
    },
    {
      q: "このカメラ、いい（　　）、ちょっと高たかいなあ。",
      options: ["けど", "から", "たり", "だけ"],
      answer: "けど",
    },
    {
      q: "A：こんど　いっしょに　レストラン　（　　　　）？B：いいね。",
      options: ["行いかない", "行いった", "行いきます", "行いかなかった"],
      answer: "行いかない",
    },
    {
      q: "A：ここは　まっすぐ？B：ううん、（　　　）へ　まがって。",
      options: ["そっち", "そち", "そっちい", "そうち"],
      answer: "そっち",
    },
    {
      q: "あしたは はやく うちへ かえらなければ（　　　）。",
      options: ["ならない", "なりない", "ない", "なる"],
      answer: "ならない",
    },
    {
      q: "あした　雨あめが　ふる（　　）思おもいます。",
      options: ["と", "を", "で", "が"],
      answer: "と",
    },
    {
      q: "A：ハリィさんは　来きませんか。B：たぶん　今日きょうは　（　　　　）と　思おもいます。",
      options: ["休やすみだ", "休やすみです", "休やすみでした", "休やすみの"],
      answer: "休やすみだ",
    },
    {
      q: "このニュース　（　　　　）どう　思おもいますか。",
      options: ["について", "のほうが", "より", "てから"],
      answer: "について",
    },
    {
      q: "A：今日きょうも　できませんでしたね。B：あしたは　（　　　　）　できますよ。",
      options: ["きっと", "そっと", "もっと", "はっと"],
      answer: "きっと",
    },
    {
      q: "しゃちょうは　あした　しゅっちょうへ　（　　　）と　言いいました。",
      options: ["行いく", "行いった", "行いきます", "行いきました"],
      answer: "行いく",
    },
    {
      q: "A：先生せんせいは　（　　　）言いいましたか。B：しゅくだいは　金曜日きんようびまでだ　と言いいました。",
      options: ["何なんと", "何なんで", "どんな", "どうして"],
      answer: "何なんと",
    },
    {
      q: "A：パーティーの　飲のみものは　たりると　思おもいますか。B：いいえ、（　　　　　　　　　）。",
      options: [
        "たりないと　思おもいます。",
        "たりると　思おもいます。",
        "たりないと　思おもいません。",
        "たりませんと　思おもいません。",
      ],
      answer: "たりないと　思おもいます。",
    },
    {
      q: "A：日本にほんの　ふゆは　（　　　）でしょう？B：ええ、ほんとうに　さむいです。",
      options: ["さむい", "さむいです", "さむくない", "さむいだ"],
      answer: "さむい",
    },
    {
      q: "A：今いまから　ビール（　　　）飲のみませんか。B：いいですね。",
      options: ["でも", "から", "ても", "なら"],
      answer: "でも",
    },
    {
      q: "A：このえいが、おもしろい（　　　　）？B：ええ、そうですね。",
      options: ["でしょう", "でした", "ましょう", "ますか"],
      answer: "でしょう",
    },
    {
      q: "A：このテレビ、高たかかったでしょう？B：いいえ、（　　　　）高たかくなかったですよ。",
      options: ["そんなに", "こんなに", "あんなに", "どんなに"],
      answer: "そんなに",
    },
    {
      q: "これは　きのう　（　　　　）　セーターです。",
      options: ["買かった", "買かいました", "買かったの", "買かう"],
      answer: "買かった",
    },
    {
      q: "それは　こども（　　）読よむ　本ほんです。",
      options: ["が", "は", "で", "を"],
      answer: "が",
    },
    {
      q: "A：ワンさんは　どの人ひとですか。B：あの　くろい　ブーツを　（　　　　　　）人ひとです。",
      options: ["はいている", "きている", "かけている", "もっている"],
      answer: "はいている",
    },
    {
      q: "A：やまださんが　（　　　　　）りょうりは　何なんですか。B：カレーライスです。",
      options: ["つくっている", "つくっています", "つくってから", "つくっての"],
      answer: "つくっている",
    },
    {
      q: "あした　（　　　）　レストランは　うちの　ちかくに　あります。",
      options: ["行いく", "行いった", "行いっている", "行いきます"],
      answer: "行いく",
    },
    {
      q: "わたしが　生うまれた　（　　　　）は　ロンドンです。",
      options: ["ところ", "こと", "どこ", "もの"],
      answer: "ところ",
    },
    {
      q: "A：あの　あかい　（　　　）を　かぶっている人ひとは　だれですか。B：しみずさんです。",
      options: ["ぼうし", "めがね", "スカート", "てぶくろ"],
      answer: "ぼうし",
    },
    {
      q: "わたしは　タバコを　（　　　　）人ひとが　好すきです。",
      options: ["すわない", "すいません", "すわないの", "すわなかった"],
      answer: "すわない",
    },
    {
      q: "きのうの　かいぎで　つかった　しりょう（　　）　見みせてください。",
      options: ["を", "が", "で", "に"],
      answer: "を",
    },
    {
      q: "A：きのうの　サッカーのしあい　見みた？B：ううん。テレビを　（　　　　）時間じかんが　なかったから。",
      options: ["見みる", "見みた", "見みない", "見みなかった"],
      answer: "見みる",
    },
    {
      q: "A：どんな　うちに　すみたいですか。B：大おおきい　にわが　（　　）うちに　すみたいです。",
      options: ["ある", "いる", "でる", "する"],
      answer: "ある",
    },
    {
      q: "わからない（　　）、先生せんせいに聞ききます。",
      options: ["とき", "ところ", "とこ", "とけい"],
      answer: "とき",
    },
    {
      q: "みち（　　）あるくとき、車くるまに きをつけてください。",
      options: ["を", "で", "に", "へ"],
      answer: "を",
    },
    {
      q: "A：（　　　　　）とき、何なにを　しますか。B：ゲームを　します。",
      options: ["ひまな", "ひまの", "ひま", "ひまが"],
      answer: "ひまな",
    },
    {
      q: "A：れいぞうこに　何なにもないとき、（　　　）しますか。B：レストランで　食たべます。",
      options: ["どう", "なん", "こう", "どれ"],
      answer: "どう",
    },
    {
      q: "ごはんを　（　　　）とき、「いただきます」と言いいます。",
      options: ["食たべる", "食たべた", "食たべるの", "食たべて"],
      answer: "食たべる",
    },
    {
      q: "A：ともだちが　（　　　　）とき、どんなものを あげますか。B：そうですね、お金かねを　あげますね。",
      options: ["けっこんした", "けっこんの", "けっこんして", "けっこんします"],
      answer: "けっこんした",
    },
    {
      q: "A：（　　　　）とき、どう　しますか。B：かおを あらいます。",
      options: ["ねむい", "ねない", "ねむいの", "ねむいな"],
      answer: "ねむい",
    },
    {
      q: "ここを　（　　　）と、電気でんきが つきます。",
      options: ["まわす", "まわする", "まわした", "まわさない"],
      answer: "まわす",
    },
    {
      q: "左ひだりへ　まがると、ゆうびんきょく（　　　　）。",
      options: ["が　あります", "に　なります", "で　います", "と　いいます"],
      answer: "が　あります",
    },
    {
      q: "A：３番ばんせんの　電車でんしゃに　のってください。B：はい、３番ばんせん（　　　　）。",
      options: ["ですね", "でしょう", "でした", "ですよ"],
      answer: "ですね",
    },
    {
      q: "つまみを まわすと音おとが（　　　　）。",
      options: [
        "大おおきく　なります",
        "大おおきいです",
        "大おおきかったです",
        "大おおきく　あります",
      ],
      answer: "大おおきく　なります",
    },
    {
      q: "キムさんは　わたしに　ワインを　（　　　　　）。",
      options: ["くれました", "あげました", "もらいました", "かりました"],
      answer: "くれました",
    },
    {
      q: "これは　ミャンマーの　食たべものです。リンさんが　（　　　　　）。",
      options: ["くれました", "あげました", "もらいました", "もちました"],
      answer: "くれました",
    },
    {
      q: "A：そのとけい　いいですね。B：これは　兄あに（　　）　くれた　とけいです。",
      options: ["が", "に", "は", "を"],
      answer: "が",
    },
    {
      q: "A：その　カードは　だれに　もらいましたか。B：タンさん（　　）　もらいました。",
      options: ["に", "が", "は", "を"],
      answer: "に",
    },
    {
      q: "A：去年きょねん　わたしが　（　　　）くつは　はいていますか。B：はい、よく　はいていますよ。ありがとうございました。",
      options: ["あげた", "もらった", "くれた", "はいた"],
      answer: "あげた",
    },
    {
      q: "ホワイトデーは　男おとこの人ひとが　女おんなの人ひと（　　）　おかしを　あげる日ひです。",
      options: ["に", "の", "を", "で"],
      answer: "に",
    },
    {
      q: "A：それは　どこで　買かいましたか。B：これは　ともだちが　（　　　　　）。",
      options: ["くれました", "もらいました", "あげました", "買かいました"],
      answer: "くれました",
    },
    {
      q: "チャンさんに　かばんを　（　　　　）　もらいました。",
      options: ["持もって", "くれて", "もらって", "あげて"],
      answer: "持もって",
    },
    {
      q: "友ともだち（　　）　ペンを　かして　くれました。",
      options: ["が", "に", "を", "へ"],
      answer: "が",
    },
    {
      q: "A：カメラを かしてください。写真しゃしんを とって（　　　　）よ。B：ありがとう。",
      options: ["あげます", "くれます", "もらいます", "とります"],
      answer: "あげます",
    },
    {
      q: "わたしは　カレンさん（　　）パソコンを　なおして　あげます。",
      options: ["の", "に", "を", "が"],
      answer: "の",
    },
    {
      q: "にもつが　（　　　　）、電話でんわして ください。",
      options: ["ついたら", "つきたら", "つくたら", "つったら"],
      answer: "ついたら",
    },
    {
      q: "A：明日あした　ひま（　　　　）、どこか　行いきませんか。B：いいですね。行いきましょう。",
      options: ["だったら", "だら", "たら", "なったら"],
      answer: "だったら",
    },
    {
      q: "A：もし　１おく円えんあったら、どう　（　　　）か。B：そうですね。大おおきい　うちを　買かいたいです。",
      options: ["します", "あります", "います", "きます"],
      answer: "します",
    },
    {
      q: "５時じに　（　　　　）ら、帰かえりましょう。",
      options: ["なった", "した", "いった", "あった"],
      answer: "なった",
    },
    {
      q: "体からだの　ちょうし（　　）　わるかったら、休やすんでも　いいですよ。",
      options: ["が", "に", "で", "を"],
      answer: "が",
    },
    {
      q: "日本語にほんごが あまり（　　　　　　）ら、英語えいごで話はなしてください。",
      options: [
        "わからなかった",
        "わかった",
        "わかりません",
        "わかりませんでした",
      ],
      answer: "わからなかった",
    },
    {
      q: "子供こどもの名前なまえは　男おとこの子こ（　　　　）「ゆうと」女おんなの子こ（　　　　）「けいこ」が　いいです。",
      options: [
        "だったら / だったら",
        "たら/ たら",
        "でたら / でたら",
        "かったら / かったら",
      ],
      answer: "だったら / だったら",
    },
    {
      q: "A：このボタンを　（　　　　　）、おつりが　でません。B：こしょうですね。",
      options: ["おしても", "おしたら", "おすと", "おしてから"],
      answer: "おしても",
    },
    {
      q: "明日あしたは　雨あめ（　　）　しあいが　あります。",
      options: ["でも", "ても", "とき", "から"],
      answer: "でも",
    },
    {
      q: "A：１日にちが　30時間じかんあったら　（　　　　）ね。B：ほんとうに　そうですね。いつも　いそがしいですから。",
      options: ["いいです", "ほしいです", "あります", "したいです"],
      answer: "いいです",
    },
    {
      q: "A：チャンスが　あったら、りゅうがく　しますか。B：いいえ、チャンスが（　　　）、りゅうがく したくないです。",
      options: ["あっても", "あったら", "あるでも", "あってから"],
      answer: "あっても",
    },
  ],
  "文法・文の文法2（前半レベル[3〜9か]）": [
    {
      q: "A：どようび（　　）（ ★ ）（　　）（　　）します。いっしょに　いきませんか。　B：いいですね。",
      options: ["と", "ともだち", "かいもの", "いっしょに"],
      answer: "と",
    },
    {
      q: "ともだち（　　）（　　）（　★　）（　　）を します。",
      options: ["で", "と", "にわ", "テニス"],
      answer: "で",
    },
    {
      q: "A：あした　いっしょ（　　）（　　）（　★　）（　　）。　B：あしたは　ちょっと。",
      options: ["へ", "レストラン", "に", "いきませんか"],
      answer: "へ",
    },
    {
      q: "けさ（　　）（　★　）（　　）（　　）たべました。",
      options: ["と", "さかな", "やさい", "を"],
      answer: "と",
    },
    {
      q: "A：ミンさん（　　）（　　）（　★　）（　　）か。B：ときどき　のみます。",
      options: ["を", "は", "のみます", "おさけ"],
      answer: "を",
    },
    {
      q: "A：２じ（　　）（　　）（　★　）（　　）。B：わかりました。じゃ、また。",
      options: ["で", "に", "がっこう", "あいましょう"],
      answer: "で",
    },
    {
      q: "この（　　）（　　）（　★　）（　　）もらいました。",
      options: ["かのじょ", "シャツ", "は", "に"],
      answer: "かのじょ",
    },
    {
      q: "まいばん　かぞく（　　）（　　）（　★　）（　　）。",
      options: ["を", "に", "でんわ", "かけます"],
      answer: "を",
    },
    {
      q: "A：もう（　　）（　　）（　★　）（　　）かいましたか。B：いいえ、まだです。　あした　かいます。",
      options: ["プレゼント", "クリスマス", "を", "の"],
      answer: "プレゼント",
    },
    {
      q: "おとうと（　　）（　★　）（　　）（　　）を　かいます。",
      options: ["いもうと", "と", "おみやげ", "に"],
      answer: "いもうと",
    },
    {
      q: "リンさんは（　　）（　★　）（　　）（　　）あげます。",
      options: ["に", "すずきさん", "はな", "を"],
      answer: "に",
    },
    {
      q: "A：なに（　　）（　★　）（　　）（　　）か。B：カメラで　とります。",
      options: ["を", "で", "しゃしん", "とります"],
      answer: "しゃしん",
    },
    {
      q: "わたしは　ナイフ（　　）（　　）（　★　）（　　）を　たべます。",
      options: ["で", "と", "にく", "フォーク"],
      answer: "で",
    },
    {
      q: "A：もう　にほん（　　）（　　）（　★　）（　　）か。B：はい、しました。",
      options: ["おはなみ", "を", "で", "しました"],
      answer: "を",
    },
    {
      q: "A：これ　（　　）（　★　）（　　）（　　）ですか。B：それは　パンチです。",
      options: ["にほんご", "は", "で", "なん"],
      answer: "にほんご",
    },
  ],
  "文法・文の文法2（中盤レベル[10〜19か]）": [
    {
      q: "A：すしは　どんな　たべものですか。B：おいしい（　　）（　　）（　★　）（　　）たべもの　です。",
      options: ["ちょっと", "です", "が", "たかい"],
      answer: "ちょっと",
    },
    {
      q: "A：ハリィさんの　くつは　どれですか。B：えーと、（　　）（　　）（　★　）（　　）よ。",
      options: ["くつ", "です", "あの", "くろい"],
      answer: "くつ",
    },
    {
      q: "にほんご（　　）（　★　）（　　）（　　）です。",
      options: ["おもしろいです", "は", "が", "むずかしい"],
      answer: "おもしろいです",
    },
    {
      q: "A：その（　　）（　　）（　★　）（　　）か。B：とても　おもしろいです。",
      options: ["どう", "えいが", "です", "は"],
      answer: "どう",
    },
    {
      q: "わたしの（　　）（　　）（　★　）（　　）。",
      options: ["あまり", "パソコン", "は", "あたらしくないです"],
      answer: "あまり",
    },
    {
      q: "A：インドネシア（　　）（　★　）（　　）（　　）。B：あつい くにですよ。",
      options: ["どんな", "は", "くに", "ですか"],
      answer: "どんな",
    },
    {
      q: "A：いっしょに　ばんごはんを　たべませんか。B：すみません、（　　）（　　）（　★ ）（　　）ありますから。",
      options: ["やくそく", "つま", "と", "が"],
      answer: "やくそく",
    },
    {
      q: "わたしは　あまり（　　）（　　）（　★　）（　　）。",
      options: ["すき", "が", "カラオケ", "じゃありません"],
      answer: "すき",
    },
    {
      q: "A：ミンさん（　　）（　★　）（　　）（　　）か。B：すみません、すもうが　ぜんぜん　わかりません。",
      options: ["すもう", "は", "すきです", "が"],
      answer: "すもう",
    },
    {
      q: "A：おかあさん（　　）（　★　）（　　）（　　）じょうずですか。B：スパゲッティが　じょうずです。",
      options: ["どんな", "りょうり", "は", "が"],
      answer: "どんな",
    },
    {
      q: "あしたは　（　　）（　★　）（　　）（　　）、うちで　べんきょうします。",
      options: ["が", "テスト", "あります", "から"],
      answer: "が",
    },
    {
      q: "A：（　　）（　　）（　★　）（　　）か。B：くるまで　きましたから。",
      options: ["を", "どうして", "おさけ", "のみません"],
      answer: "を",
    },
    {
      q: "はこ（　　）（　　）（　★　）（　　）が　あります。",
      options: ["に", "の", "なか", "かぎ"],
      answer: "に",
    },
    {
      q: "A：あの　（　　）（　★　）（　　）（　　）いますか。B：たなかさんが　います。",
      options: ["に", "へや", "だれ", "が"],
      answer: "に",
    },
    {
      q: "あの（　　）（　　）（　★　）（　　）でんちが あります。",
      options: ["２だんめ", "たな", "の", "に"],
      answer: "２だんめ",
    },
    {
      q: "A：きっさてんは　どこに　ありますか。B：ほんや（　　）（　★　）（　　）（　　）に　あります。",
      options: ["スーパー", "と", "の", "あいだ"],
      answer: "スーパー",
    },
    {
      q: "A：うちの　ちかくに　なにが　ありますか。B：スーパー（　　）（　　）（　★　）（　　）　あります。",
      options: ["など", "が", "や", "きっさてん"],
      answer: "など",
    },
    {
      q: "A：ビール（　　）（　　）（　★　）（　　）か。B：れいぞうこの　なかに　あります。",
      options: ["に", "は", "どこ", "あります"],
      answer: "に",
    },
    {
      q: "A：スーパーで　何なにを　かいますか。B：りんご（　　）（　★　）（　　）（　　）を　ふたつ　おねがいします。",
      options: ["いつつ", "を", "と", "みかん"],
      answer: "いつつ",
    },
    {
      q: "A：うちに　でんわ（　　）（　★　）（　　）（　　）。B：２だい　あります。",
      options: ["なんだい", "が", "あります", "か"],
      answer: "なんだい",
    },
    {
      q: "A：やまださん（　　）（　★　）（　　）（　　）が　何人なんにん　いますか。B：５０人にん　います。",
      options: ["かいしゃ", "の", "に", "しゃいん"],
      answer: "かいしゃ",
    },
    {
      q: "とうきょう（　　）（　　）（　★　）（　　）で　２じかんはん　かかります。",
      options: ["まで", "おおさか", "から", "しんかんせん"],
      answer: "まで",
    },
    {
      q: "１かげつ（　　）（　★　）（　　）（　　）見みますか。",
      options: ["なんかい", "に", "えいが", "を"],
      answer: "なんかい",
    },
    {
      q: "A：かいしゃから　（　　）（　　）（　★　）（　　）か。B：くるまで　１０ぷん　ぐらいです。",
      options: ["どのくらい", "まで", "うち", "かかります"],
      answer: "どのくらい",
    },
    {
      q: "A：ピザは　おいしいですね。B：でも　わたしは　ピザ（　　）（　　）（　★　）（　　）すきです。",
      options: ["の", "より", "ハンバーガー", "ほうが"],
      answer: "の",
    },
    {
      q: "にちようび　うみへ　行いきました。日本にほん（　　）（　　）（　★　）（　　）おおかったです。",
      options: ["人ひと", "の", "うみは", "が"],
      answer: "人ひと",
    },
    {
      q: "このホテルは　（　　）（　★　）（　　）（　　）じゃありませんでした。",
      options: ["が", "やすかったです", "あまり", "きれい"],
      answer: "が",
    },
    {
      q: "A：リンさん（　　）（　★　）（　　）（　　）でしたか。B：みんな　げんきでした。",
      options: ["ごかぞく", "の", "は", "どう"],
      answer: "ごかぞく",
    },
    {
      q: "このかばんは　（　　）（　★　）（　　）（　　）おもいです。",
      options: ["あかい", "より", "あの", "かばん"],
      answer: "あかい",
    },
    {
      q: "A：コーヒーと（　　）（　　）（　★　）（　　）いいですか。B：おちゃで　おねがいします。",
      options: ["どちら", "と", "おちゃ", "が"],
      answer: "どちら",
    },
    {
      q: "A：こんしゅう（　　）（　　）（　★　）（　　）ひまですか。B：土どようび　です。",
      options: ["が", "で", "いつ", "いちばん"],
      answer: "が",
    },
    {
      q: "日本にほんの　（　　）（　★　）（　　）（　　）いちばん　よかったです。",
      options: ["で", "りょこう", "きょうと", "が"],
      answer: "で",
    },
    {
      q: "A：リンさんの　くにで　（　　）（　　）（　　）（　★　）ですか。B：ヤンゴンです。",
      options: ["が", "どこ", "ゆうめい", "いちばん"],
      answer: "ゆうめい",
    },
    {
      q: "おなかが　（　　）（　★　）（　　）（　　）です。",
      options: ["から", "すきました", "食たべたい", "ごはんを"],
      answer: "から",
    },
    {
      q: "A：やまださんは　しょうらい　けっこんしたいですか。B：いいえ、ひとりが　（　　）（　　）（　★　）（　　）したくないです。",
      options: ["あまり", "すきです", "から", "けっこん"],
      answer: "あまり",
    },
    {
      q: "わたしは　りょうりが　へたですから、りょうり（　　）（　★　）（　　）（　　）です。",
      options: ["じょうずな", "が", "つまが", "ほしい"],
      answer: "じょうずな",
    },
    {
      q: "A：どうして　日本にほんへ　きましたか。B：日本にほんの　（　　）（　★　）（　　）（　　）　きました。",
      options: ["で", "かいしゃ", "に", "はたらき"],
      answer: "で",
    },
    {
      q: "A：こんしゅう（　　）（　★　）（　　）（　　）　行いきますか。B：いいえ、どこも　行いきません。",
      options: ["日にちよう日び", "か", "の", "どこ"],
      answer: "日にちよう日び",
    },
    {
      q: "らいげつ　（　　）（　　）（　★　）（　　）　へ　かえります。",
      options: ["あいに", "かぞく", "に", "国くに"],
      answer: "あいに",
    },
    {
      q: "すみません、ちょっと（　　）（　　）（　★　）（　　）。",
      options: ["とって", "ボールペン", "ください", "を"],
      answer: "とって",
    },
    {
      q: "あの（　　）（　　）（　★　）（　　）とめて　ください。",
      options: ["まえ", "あかい", "で", "うちの"],
      answer: "まえ",
    },
    {
      q: "さむいです（　　）（　★　）（　　）（　　）ください。",
      options: ["エアコン", "から", "を", "けして"],
      answer: "エアコン",
    },
    {
      q: "まいばん　（　　）（　　）（　★　）（　　）、あまり　じょうずじゃ　ありません。",
      options: ["しています", "日本語にほんごを", "べんきょう", "が"],
      answer: "しています",
    },
    {
      q: "A：おしごとは？B：わたしは　コンピューター（　　）（　★　）（　　）（　　）います。",
      options: ["かいしゃ", "はたらいて", "の", "で"],
      answer: "かいしゃ",
    },
    {
      q: "A：すみません、このテスト、（　　）（　　）（　★　）（　　）ですか。B：いいえ、えんぴつで　書かいて　ください。",
      options: ["書かいても", "で", "いい", "ボールペン"],
      answer: "書かいても",
    },
    {
      q: "びじゅつかんで　しゃしん（　　）（　★　）（　　）（　　）。",
      options: ["とって", "を", "いけません", "は"],
      answer: "とって",
    },
    {
      q: "ここに　（　　）（　　）（　★　）（　　）ですか。",
      options: ["とめても", "車くるま", "を", "いい"],
      answer: "とめても",
    },
    {
      q: "A：ゆうびんきょくまで　どうやって　行いきますか。B：まず（　　）（　　）（　★　）（　　）へ　まがってください。",
      options: ["それから", "まっすぐ", "行いって", "みぎ"],
      answer: "それから",
    },
    {
      q: "A：もう　しりょうを　コピーしましたか。B：いいえ、まだです。（　　）（　★　）（　　）（　　）コピーします。",
      options: ["しごとが", "この", "から", "おわって"],
      answer: "しごとが",
    },
    {
      q: "A：デパートで　なにを　しましたか。B：ふくを（　　）（　★　）（　　）（　　）見みました。",
      options: ["しょくじして", "買かって", "えいが", "を"],
      answer: "しょくじして",
    },
    {
      q: "A：ふるさとは　どんな　ところですか。B：そうですね。うみ（　　）（　★　）（　　）（　　）ですよ。",
      options: ["ちかくて", "が", "すずしい", "ところ"],
      answer: "ちかくて",
    },
    {
      q: "A：やまださんは　どの　人ひとですか。B：あの（　　）（　　）（　★　）（　　）人ひとです。",
      options: ["せが", "かみが", "みじかくて", "高たかい"],
      answer: "せが",
    },
    {
      q: "これは たいせつな（　　）（　　）（　★　）（　　）。",
      options: ["なくさないで", "かぎです", "から", "ください"],
      answer: "なくさないで",
    },
    {
      q: "A：かいぎ（　　）（　　）（　★　）（　　）か。B：１０時じぐらい です。",
      options: ["までに", "は", "なんじ", "おわります"],
      answer: "までに",
    },
    {
      q: "A：これは　（　　）（　　）（　★　）（　　）か。B：はい、おねがいします。",
      options: ["書かかなければ", "えんぴつ", "で", "なりません"],
      answer: "書かかなければ",
    },
    {
      q: "あしたから休やすみです（　　）（　★　）（　　）（　　）。",
      options: ["会社かいしゃへ", "から", "行いかなくても", "いいです"],
      answer: "会社かいしゃへ",
    },
  ],
  "文法・文の文法2（後半レベル[20〜27か]）": [
    {
      q: "A：どこで　（　　）（　　）（　★　）（　　）か。B：ぎんこうで　できます。",
      options: ["ことが", "お金かねを", "かえる", "できます"],
      answer: "ことが",
    },
    {
      q: "日曜日にちようびは だれも（　　）（　★　）（　　）（　　）ことが できません。",
      options: ["から", "いません", "会社かいしゃを", "見学けんがくする"],
      answer: "から",
    },
    {
      q: "このかんじを　（　　）（　　）（　★　）（　　）書かくことが できません。",
      options: ["できます", "読よむ", "ことが", "が"],
      answer: "できます",
    },
    {
      q: "ごはんを　（　　）（　★　）（　　）（　　）ください。",
      options: ["前まえに", "食たべる", "手てを", "あらって"],
      answer: "前まえに",
    },
    {
      q: "きむらさん（　　）（　　）（　★　）（　　）を　見みることです。",
      options: ["は", "しゅみ", "えいが", "の"],
      answer: "は",
    },
    {
      q: "A：キムさんは　（　　）（　　）（　★　）（　　）ありますか。B：ええ、ありますよ。",
      options: ["飲のんだ", "日本にほんの", "おさけを", "ことが"],
      answer: "飲のんだ",
    },
    {
      q: "まだ いちども リサさんに（　　）（　★　）（　　）（　　）会あいたいです。",
      options: ["ことが", "ありません", "会あった", "から"],
      answer: "ことが",
    },
    {
      q: "やきゅうを（　　）（　　）（　★　）（　　）したことが ありません。",
      options: ["あります", "見みた", "ことが", "が"],
      answer: "あります",
    },
    {
      q: "としょかんで しょくじしたり、（　　）（　★　）（　　）（　　）。",
      options: ["話はなしたり", "人ひとと", "しては", "いけません"],
      answer: "話はなしたり",
    },
    {
      q: "きのう そうじ（　  ）（　　）（　★　）（　　）なりました。",
      options: ["へやは", "しました", "から", "きれいに"],
      answer: "へやは",
    },
    {
      q: "A：このあいだ ともだち（　　）（　　）（　★　）（　　）よ。B：へえ、どうだった？",
      options: ["を", "と", "テニス", "した"],
      answer: "を",
    },
    {
      q: "A：りょこうは　どうだった？B：天気てんきも（　　）（　★　）（　　）（　　）よ。",
      options: ["食たべものも", "よくて", "とても", "おいしかった"],
      answer: "食たべものも",
    },
    {
      q: "A：日曜日にちようびは　ひま？B：ごめん。日曜日にちようびは（　　）（　　）（　★　）（　　）？",
      options: ["土曜日どようびは", "むりだ", "から", "どう"],
      answer: "土曜日どようびは",
    },
    {
      q: "A：この（　　）（　　）（　★　）（　　）。B：わかりました。",
      options: ["コピー", "しりょう", "１０まい", "して"],
      answer: "コピー",
    },
    {
      q: "きょねんまで（　　）（　★　）（　　）（　　）けど、今いまは だめだ。",
      options: ["タバコを", "ここで", "すっても", "よかった"],
      answer: "タバコを",
    },
    {
      q: "A：日本にほんの（　　）（　　）（　★　）（　　）か。B：とても　いそがしいと　思おもいます。",
      options: ["どう", "会社かいしゃ", "について", "思おもいます"],
      answer: "どう",
    },
    {
      q: "だいとうりょうは　（　　）（　★　）（　　）（　　）言いいました。",
      options: ["しゅしょうに", "日本にほんの", "会あう", "と"],
      answer: "しゅしょうに",
    },
    {
      q: "わたしは　（　　）（　　）（　★　）（　　）と　言いいました。",
      options: ["しおを", "リンさん", "に", "とって"],
      answer: "しおを",
    },
    {
      q: "らいしゅう　なごやで　（　　）（　★　）（　　）（　　）？",
      options: ["おまつりが", "大おおきい", "ある", "でしょう"],
      answer: "おまつりが",
    },
    {
      q: "A：あしたは　（　　）（　　）（　★　）（　　）でしょう？B：はい、休やすみは　今日きょうまで　です。",
      options: ["行いかなければ", "会社かいしゃ", "ならない", "へ"],
      answer: "行いかなければ",
    },
    {
      q: "これは　おととい（　　）（　★　）（　　）（　　）です。",
      options: ["ミンさん", "に", "てがみ", "もらった"],
      answer: "に",
    },
    {
      q: "きのう　わたしたち（　　）（　　）（　★　）（　　）とても　きれいでした。",
      options: ["きょうかい", "は", "行いった", "が"],
      answer: "きょうかい",
    },
    {
      q: "A：あそこ（　　）（　★　）（　　）（　　）だれですか。B：すぎもとさんです。",
      options: ["サッカーを", "で", "している", "人ひとは"],
      answer: "サッカーを",
    },
    {
      q: "A：今いまから　でかけませんか。B：すみません。（　　）（　★　）（　　）（　　）から、ちょっと･･･。",
      options: ["電話でんわする", "ともだちに", "やくそくが", "あります"],
      answer: "電話でんわする",
    },
    {
      q: "A：きむらさんの　となりに（　　）（　　）（　★　）（　　）いますか。B：いいえ、しりません。",
      options: ["を", "すわっている", "人ひと", "しって"],
      answer: "を",
    },
    {
      q: "A：すみません、（　　）（　　）（　★　）（　　）しますか。B：ここに　電話でんわして　ください",
      options: ["とき", "きかいが", "こしょうの", "どう"],
      answer: "とき",
    },
    {
      q: "A：リンさんの　（　　）（　★　）（　　）（　　）しますか。B：ともだちと　パーティーを　します。",
      options: ["おしょうがつの", "くにで", "とき", "何なにを"],
      answer: "おしょうがつの",
    },
    {
      q: "いい（　　）（　★　）（　　）（　　）を さんぽします。",
      options: ["の", "天気てんき", "とき", "こうえん"],
      answer: "の",
    },
    {
      q: "このりょうりは少すこし（　　）（　　）（　★　）（　　）なりますよ。",
      options: ["と", "しおを", "入いれる", "おいしく"],
      answer: "と",
    },
    {
      q: "まっすぐ行いって、（　　）（　★　）（　　）（　　）が あります。",
      options: ["わたると", "ふみきりを", "右みぎに", "スーパー"],
      answer: "わたると",
    },
    {
      q: "A：すてきな　ネクタイですね。B：今いまの　会社かいしゃに（　　）（　　）（　★　）（　　）くれました。",
      options: ["そぼ", "入はいった", "とき", "が"],
      answer: "そぼ",
    },
    {
      q: "日本にほんや中国ちゅうごくでは お正月しょうがつに子こども（　　）（　　）（　★　）（　　）を もらいます。",
      options: ["に", "は", "かぞく", "お金かね"],
      answer: "に",
    },
    {
      q: "これは（　　）（　★　）（　　）（　　）じてんしゃ です。",
      options: ["たんじょうびに", "去年きょねんの", "りょうしんが", "くれた"],
      answer: "たんじょうびに",
    },
    {
      q: "A：びょういんへ　行いきたいですが、　どうやって　行いきますか。B：すずきさん（　　）（　　）（　★　）（　　）くれますよ。",
      options: ["つれて", "が", "車くるまで", "行いって"],
      answer: "つれて",
    },
    {
      q: "いろいろな（　　）（　★　）（　　）（　　）から、しごとが　終おわりました。",
      options: ["に", "人ひと", "手伝てつだって", "もらいました"],
      answer: "に",
    },
    {
      q: "国くにへ（　　）（　　）（　★　）（　　）です。",
      options: [
        "先生せんせいに",
        "帰かえったら",
        "日本語にほんごの",
        "なりたい",
      ],
      answer: "先生せんせいに",
    },
    {
      q: "A：もし（　　）（　　）（　★　）（　　）作つくりますか。B：そうですね。コンピューターの　会社かいしゃが　いいですね。",
      options: ["どんな", "しゃちょうに", "会社かいしゃを", "なったら"],
      answer: "どんな",
    },
    {
      q: "A：買かい物ものの（　　）（　★　）（　　）（　　）しますか。B：ATMへ　行いきます。",
      options: ["お金かねが", "とき", "たりなかったら", "どう"],
      answer: "お金かねが",
    },
    {
      q: "明日あしたは　テストです（　　）（　　）（　★　）（　　）なりません。",
      options: ["勉強べんきょう", "から", "ねむくても", "しなければ"],
      answer: "勉強べんきょう",
    },
    {
      q: "土曜日どようびが（　　）（　　）（　★　）（　　）どうですか。",
      options: ["日曜日にちようび", "むり", "なら", "は"],
      answer: "日曜日にちようび",
    },
  ],
};

export default QUESTION_GROUPS;
